MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BTU2_REG.h
#define BTU2_REG_BTU_RIF_CTL0_BRF_RD_DATA_TURNAROUND_MASK (0x1U)
#define BTU2_REG_BTU_RIF_CTL0_BRF_RD_DATA_TURNAROUND_SHIFT (0U)
/*! BRF_Rd_Data_Turnaround - BRF Read Data Turnaround
 *  0b0..BRF read data will be ready on the next clock cycle after address given
 *  0b1..BRF needs one more clock cycle between address and read data
 */
#define BTU2_REG_BTU_RIF_CTL0_BRF_RD_DATA_TURNAROUND(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_CTL0_BRF_RD_DATA_TURNAROUND_SHIFT)) & BTU2_REG_BTU_RIF_CTL0_BRF_RD_DATA_TURNAROUND_MASK)

#define BTU2_REG_BTU_RIF_CTL0_BRF_AGC_COUNTER_READBACK_ENABLE_MASK (0x2U)
#define BTU2_REG_BTU_RIF_CTL0_BRF_AGC_COUNTER_READBACK_ENABLE_SHIFT (1U)
/*! BRF_AGC_Counter_Readback_Enable - Enable BRF readback LNA, CBPF and ADC overflow counters after AGC freeze
 *  0b0..BRF only readback RSSI and noise floor values at RSSI
 *  0b1..BRF readback extra 3 bytes (LNA, CBPF and ADC overflow counters) after RSSI read
 */
#define BTU2_REG_BTU_RIF_CTL0_BRF_AGC_COUNTER_READBACK_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_CTL0_BRF_AGC_COUNTER_READBACK_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_CTL0_BRF_AGC_COUNTER_READBACK_ENABLE_MASK)

#define BTU2_REG_BTU_RIF_CTL0_RADIO_TYPE_MASK    (0x700U)
#define BTU2_REG_BTU_RIF_CTL0_RADIO_TYPE_SHIFT   (8U)
/*! Radio_Type - Radio Type
 *  0b000..Unknown
 *  0b001..Marvell Gen3 radio, dBus mode
 *  0b010..Marvell Gen4 radio, dBus mode
 */
#define BTU2_REG_BTU_RIF_CTL0_RADIO_TYPE(x)      (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_CTL0_RADIO_TYPE_SHIFT)) & BTU2_REG_BTU_RIF_CTL0_RADIO_TYPE_MASK)

#define BTU2_REG_BTU_RIF_CTL0_RADIO_MODE_MASK    (0x1800U)
#define BTU2_REG_BTU_RIF_CTL0_RADIO_MODE_SHIFT   (11U)
/*! Radio_Mode - Radio Mode Selection
 *  0b00..Marvell Radio Mode
 *  0b01..KW Radio, Sideband RIF interface
 *  0b10..Unused
 *  0b11..Unused
 */
#define BTU2_REG_BTU_RIF_CTL0_RADIO_MODE(x)      (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_CTL0_RADIO_MODE_SHIFT)) & BTU2_REG_BTU_RIF_CTL0_RADIO_MODE_MASK)
/*! @} */

/*! @name BTU_RIF_RX_SIGNAL_QUAL0 - RIF Rx SIGNAL QUALITY 0 */
/*! @{ */

#define BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL0_LINKBDRRXSIGNALQUALITYEN_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL0_LINKBDRRXSIGNALQUALITYEN_SHIFT (0U)
/*! linkBdrRxSignalQualityEn - RX signal quality enable on BDR */
#define BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL0_LINKBDRRXSIGNALQUALITYEN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL0_LINKBDRRXSIGNALQUALITYEN_SHIFT)) & BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL0_LINKBDRRXSIGNALQUALITYEN_MASK)

#define BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL0_RXSIGNALQUALSAMPLEDELAY_MASK (0xFC00U)
#define BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL0_RXSIGNALQUALSAMPLEDELAY_SHIFT (10U)
/*! rxSignalQualSampleDelay - RX signal qual sample time */
#define BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL0_RXSIGNALQUALSAMPLEDELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL0_RXSIGNALQUALSAMPLEDELAY_SHIFT)) & BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL0_RXSIGNALQUALSAMPLEDELAY_MASK)
/*! @} */

/*! @name BTU_RIF_RX_SIGNAL_QUAL1 - RIF Rx SIGNAL QUALITY 0 */
/*! @{ */

#define BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL1_LINKEDRRXSIGNALQUALITYEN_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL1_LINKEDRRXSIGNALQUALITYEN_SHIFT (0U)
/*! linkEdrRxSignalQualityEn - RX signal quality enable on EDR */
#define BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL1_LINKEDRRXSIGNALQUALITYEN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL1_LINKEDRRXSIGNALQUALITYEN_SHIFT)) & BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL1_LINKEDRRXSIGNALQUALITYEN_MASK)

#define BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL1_RXSIGNALQUALCNT_MASK (0x3C00U)
#define BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL1_RXSIGNALQUALCNT_SHIFT (10U)
/*! rxSignalQualCnt - RX signal quality debug counter */
#define BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL1_RXSIGNALQUALCNT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL1_RXSIGNALQUALCNT_SHIFT)) & BTU2_REG_BTU_RIF_RX_SIGNAL_QUAL1_RXSIGNALQUALCNT_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_RSSI_ADDR - RIF BRF RSSI Address */
/*! @{ */

#define BTU2_REG_BTU_RIF_BRF_RSSI_ADDR_RSSI_ADDR_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_BRF_RSSI_ADDR_RSSI_ADDR_SHIFT (0U)
/*! RSSI_Addr - RSSI Address */
#define BTU2_REG_BTU_RIF_BRF_RSSI_ADDR_RSSI_ADDR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_RSSI_ADDR_RSSI_ADDR_SHIFT)) & BTU2_REG_BTU_RIF_BRF_RSSI_ADDR_RSSI_ADDR_MASK)
/*! @} */

/*! @name BTU_RIF_CTRL1 - RIF Control 1 */
/*! @{ */

#define BTU2_REG_BTU_RIF_CTRL1_BD_SPI_DATA_BIDIR_MASK (0x40U)
#define BTU2_REG_BTU_RIF_CTRL1_BD_SPI_DATA_BIDIR_SHIFT (6U)
/*! Bd_SPI_Data_BiDir - Uni- or Bi-directional dBus Data Line Selection
 *  0b0..uni-directional
 *  0b1..bi-directional
 */
#define BTU2_REG_BTU_RIF_CTRL1_BD_SPI_DATA_BIDIR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_CTRL1_BD_SPI_DATA_BIDIR_SHIFT)) & BTU2_REG_BTU_RIF_CTRL1_BD_SPI_DATA_BIDIR_MASK)

#define BTU2_REG_BTU_RIF_CTRL1_BD_RXTX_DATA_BIDIR_MASK (0x80U)
#define BTU2_REG_BTU_RIF_CTRL1_BD_RXTX_DATA_BIDIR_SHIFT (7U)
/*! Bd_RxTx_Data_BiDir - Uni- or Bi-directional RxData and TxData Line Selection
 *  0b0..uni-directional
 *  0b1..bi-directional
 */
#define BTU2_REG_BTU_RIF_CTRL1_BD_RXTX_DATA_BIDIR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_CTRL1_BD_RXTX_DATA_BIDIR_SHIFT)) & BTU2_REG_BTU_RIF_CTRL1_BD_RXTX_DATA_BIDIR_MASK)

#define BTU2_REG_BTU_RIF_CTRL1_RSSI_VALUE_MASK   (0xFF00U)
#define BTU2_REG_BTU_RIF_CTRL1_RSSI_VALUE_SHIFT  (8U)
/*! RSSI_Value - RSSI Value */
#define BTU2_REG_BTU_RIF_CTRL1_RSSI_VALUE(x)     (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_CTRL1_RSSI_VALUE_SHIFT)) & BTU2_REG_BTU_RIF_CTRL1_RSSI_VALUE_MASK)
/*! @} */

/*! @name BTU_RIF_RXON - RIF RXON */
/*! @{ */

#define BTU2_REG_BTU_RIF_RXON_RXON_FIXED_MASK    (0x80U)
#define BTU2_REG_BTU_RIF_RXON_RXON_FIXED_SHIFT   (7U)
/*! RxOn_Fixed - RxOn fixed or use programmable timing
 *  0b0..use start and stop timing parameters
 *  0b1..rxOn = RxOn_Start[6]
 */
#define BTU2_REG_BTU_RIF_RXON_RXON_FIXED(x)      (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RXON_RXON_FIXED_SHIFT)) & BTU2_REG_BTU_RIF_RXON_RXON_FIXED_MASK)

#define BTU2_REG_BTU_RIF_RXON_RXON_STOP_MASK     (0xFF00U)
#define BTU2_REG_BTU_RIF_RXON_RXON_STOP_SHIFT    (8U)
/*! RxOn_Stop - Delay from Rx finished (rifRx low) to rxOn falling edge */
#define BTU2_REG_BTU_RIF_RXON_RXON_STOP(x)       (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RXON_RXON_STOP_SHIFT)) & BTU2_REG_BTU_RIF_RXON_RXON_STOP_MASK)
/*! @} */

/*! @name BTU_RIF_PLLCLKEN_ON_DELAY - RIF PLL Clock Enable */
/*! @{ */

#define BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_ON_DELAY_QUS_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_ON_DELAY_QUS_SHIFT (0U)
/*! BRF_PLL_Clk_En_On_Delay_qus - Delay from wakeUp to turning of BRF's PLL clock */
#define BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_ON_DELAY_QUS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_ON_DELAY_QUS_SHIFT)) & BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_ON_DELAY_QUS_MASK)

#define BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_NB_MASK (0x4000U)
#define BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_NB_SHIFT (14U)
/*! BRF_PLL_Clk_En_Nb - Activate brf_pll_clk_en during NB/MB scan packets Enable
 *  0b0..keep off during NB/MB scan packets
 *  0b1..activate brf_pll_clk_en during NB/MB scan packets
 */
#define BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_NB(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_NB_SHIFT)) & BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_NB_MASK)

#define BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_FIXED_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_FIXED_SHIFT (15U)
/*! BRF_PLL_Clk_En_Fixed - Use fixed value for brf_pll_clk_en
 *  0b0..on/off_delay registers control the timing
 *  0b1..brf_pll_clk_en is the fixed value of bit[0]
 */
#define BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_FIXED(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_FIXED_SHIFT)) & BTU2_REG_BTU_RIF_PLLCLKEN_ON_DELAY_BRF_PLL_CLK_EN_FIXED_MASK)
/*! @} */

/*! @name BTU_RIF_TXON - RIF Tx On */
/*! @{ */

#define BTU2_REG_BTU_RIF_TXON_TXON_FIXED_MASK    (0x80U)
#define BTU2_REG_BTU_RIF_TXON_TXON_FIXED_SHIFT   (7U)
/*! TxOn_Fixed - TxOn fixed, or use programmable timing
 *  0b0..use start and stop timing parameters
 *  0b1..txOn = TxOn_Start[6]
 */
#define BTU2_REG_BTU_RIF_TXON_TXON_FIXED(x)      (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_TXON_TXON_FIXED_SHIFT)) & BTU2_REG_BTU_RIF_TXON_TXON_FIXED_MASK)

#define BTU2_REG_BTU_RIF_TXON_TXON_STOP_MASK     (0xFF00U)
#define BTU2_REG_BTU_RIF_TXON_TXON_STOP_SHIFT    (8U)
/*! TxOn_Stop - Delay from Tx finished (rifTx low) to txOn falling edge */
#define BTU2_REG_BTU_RIF_TXON_TXON_STOP(x)       (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_TXON_TXON_STOP_SHIFT)) & BTU2_REG_BTU_RIF_TXON_TXON_STOP_MASK)
/*! @} */

/*! @name BTU_RIF_PLLCLKEN_OFF_DELAY - RIF PLL Clock Enable Off Delay */
/*! @{ */

#define BTU2_REG_BTU_RIF_PLLCLKEN_OFF_DELAY_BRF_PLL_CLK_EN_OFF_DELAY_MASK (0x7FU)
#define BTU2_REG_BTU_RIF_PLLCLKEN_OFF_DELAY_BRF_PLL_CLK_EN_OFF_DELAY_SHIFT (0U)
/*! BRF_PLL_Clk_En_Off_Delay - Delay from final dBus access finishing to turning off BRF PLL clock */
#define BTU2_REG_BTU_RIF_PLLCLKEN_OFF_DELAY_BRF_PLL_CLK_EN_OFF_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_PLLCLKEN_OFF_DELAY_BRF_PLL_CLK_EN_OFF_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_PLLCLKEN_OFF_DELAY_BRF_PLL_CLK_EN_OFF_DELAY_MASK)
/*! @} */

/*! @name BTU_RIF_FREQ - RIF FREQ */
/*! @{ */

#define BTU2_REG_BTU_RIF_FREQ_RXTX_FREQ_MASK     (0x100U)
#define BTU2_REG_BTU_RIF_FREQ_RXTX_FREQ_SHIFT    (8U)
/*! RxTx_Freq - Rx or Tx Slot Indication
 *  0b0..Tx slot
 *  0b1..Rx slot
 */
#define BTU2_REG_BTU_RIF_FREQ_RXTX_FREQ(x)       (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_FREQ_RXTX_FREQ_SHIFT)) & BTU2_REG_BTU_RIF_FREQ_RXTX_FREQ_MASK)

#define BTU2_REG_BTU_RIF_FREQ_FREQ_MASK          (0xFE00U)
#define BTU2_REG_BTU_RIF_FREQ_FREQ_SHIFT         (9U)
/*! Freq - Channel Hop Frequency Number */
#define BTU2_REG_BTU_RIF_FREQ_FREQ(x)            (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_FREQ_FREQ_SHIFT)) & BTU2_REG_BTU_RIF_FREQ_FREQ_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_TX_PU - RIF BRF Power Up for TX */
/*! @{ */

#define BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_ON_DELAY_QUS_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_ON_DELAY_QUS_SHIFT (0U)
/*! brf_tx_pu_on_delay_qus - brf_pu on delay */
#define BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_ON_DELAY_QUS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_ON_DELAY_QUS_SHIFT)) & BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_ON_DELAY_QUS_MASK)

#define BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_OFF_DELAY_QUS_MASK (0x7F00U)
#define BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_OFF_DELAY_QUS_SHIFT (8U)
/*! brf_tx_pu_off_delay_qus - brf_pu off delay */
#define BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_OFF_DELAY_QUS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_OFF_DELAY_QUS_SHIFT)) & BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_OFF_DELAY_QUS_MASK)

