MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BTU2_REG.h
#define BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_FIXED_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_FIXED_SHIFT (15U)
/*! brf_tx_pu_fixed - Set brf_pu to a fixed value.
 *  0b0..use programmable timers
 *  0b1..fixed, brf_pu = brf_tx_pu_on_delay_us[0]
 */
#define BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_FIXED(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_FIXED_SHIFT)) & BTU2_REG_BTU_RIF_BRF_TX_PU_BRF_TX_PU_FIXED_MASK)
/*! @} */

/*! @name BTU_RIF_CTRL2 - RIF Control 2 */
/*! @{ */

#define BTU2_REG_BTU_RIF_CTRL2_TX_DATA_INV_MASK  (0x2000U)
#define BTU2_REG_BTU_RIF_CTRL2_TX_DATA_INV_SHIFT (13U)
/*! Tx_Data_Inv - Invert Tx data
 *  0b0..normal operation
 *  0b1..transmit data inverted
 */
#define BTU2_REG_BTU_RIF_CTRL2_TX_DATA_INV(x)    (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_CTRL2_TX_DATA_INV_SHIFT)) & BTU2_REG_BTU_RIF_CTRL2_TX_DATA_INV_MASK)

#define BTU2_REG_BTU_RIF_CTRL2_RX_DATA_INV_MASK  (0x4000U)
#define BTU2_REG_BTU_RIF_CTRL2_RX_DATA_INV_SHIFT (14U)
/*! Rx_Data_Inv - Invert Rx data
 *  0b0..normal operation
 *  0b1..receive data inverted
 */
#define BTU2_REG_BTU_RIF_CTRL2_RX_DATA_INV(x)    (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_CTRL2_RX_DATA_INV_SHIFT)) & BTU2_REG_BTU_RIF_CTRL2_RX_DATA_INV_MASK)
/*! @} */

/*! @name BTU_RIF_TX_PULSE - RIF Tx Pulse */
/*! @{ */

#define BTU2_REG_BTU_RIF_TX_PULSE_TX_PULSE_DELAY_MASK (0x7FFU)
#define BTU2_REG_BTU_RIF_TX_PULSE_TX_PULSE_DELAY_SHIFT (0U)
/*! tx_Pulse_Delay - Tx Pulse Delay */
#define BTU2_REG_BTU_RIF_TX_PULSE_TX_PULSE_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_TX_PULSE_TX_PULSE_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_TX_PULSE_TX_PULSE_DELAY_MASK)

#define BTU2_REG_BTU_RIF_TX_PULSE_TX_PULSE_EN_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_TX_PULSE_TX_PULSE_EN_SHIFT (15U)
/*! tx_Pulse_En - Enable TxData sync pulse
 *  0b0..TxData sync pulse deactivated and pulse not generated
 *  0b1..TxData sync pulse activated and pulse generated
 */
#define BTU2_REG_BTU_RIF_TX_PULSE_TX_PULSE_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_TX_PULSE_TX_PULSE_EN_SHIFT)) & BTU2_REG_BTU_RIF_TX_PULSE_TX_PULSE_EN_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_TX_PWRCTL - RIF dBus Tx Power Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_DBUS_TX_PWRCTL_DBUS_TX_PWR_CTRL_WR_DELAY_MASK (0x7FFU)
#define BTU2_REG_BTU_RIF_DBUS_TX_PWRCTL_DBUS_TX_PWR_CTRL_WR_DELAY_SHIFT (0U)
/*! DBus_Tx_Pwr_Ctrl_Wr_Delay - Delay from the trigger to start Tx Power Control Write dBus */
#define BTU2_REG_BTU_RIF_DBUS_TX_PWRCTL_DBUS_TX_PWR_CTRL_WR_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_TX_PWRCTL_DBUS_TX_PWR_CTRL_WR_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_TX_PWRCTL_DBUS_TX_PWR_CTRL_WR_DELAY_MASK)

#define BTU2_REG_BTU_RIF_DBUS_TX_PWRCTL_DBUS_TX_PWR_CTRL_WR_ENABLE_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_DBUS_TX_PWRCTL_DBUS_TX_PWR_CTRL_WR_ENABLE_SHIFT (15U)
/*! DBus_Tx_Pwr_Ctrl_Wr_Enable - Enable Automatic Tx Power Control Write on the dBus */
#define BTU2_REG_BTU_RIF_DBUS_TX_PWRCTL_DBUS_TX_PWR_CTRL_WR_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_TX_PWRCTL_DBUS_TX_PWR_CTRL_WR_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_TX_PWRCTL_DBUS_TX_PWR_CTRL_WR_ENABLE_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_RX_PWRCTL - RIF dBus Rx Power Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_DBUS_RX_PWRCTL_DBUS_RX_PWR_CTRL_WR_DELAY_MASK (0x7FFU)
#define BTU2_REG_BTU_RIF_DBUS_RX_PWRCTL_DBUS_RX_PWR_CTRL_WR_DELAY_SHIFT (0U)
/*! DBus_Rx_Pwr_Ctrl_Wr_Delay - Delay from the trigger to start Rx Power Control Write dBus */
#define BTU2_REG_BTU_RIF_DBUS_RX_PWRCTL_DBUS_RX_PWR_CTRL_WR_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_RX_PWRCTL_DBUS_RX_PWR_CTRL_WR_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_RX_PWRCTL_DBUS_RX_PWR_CTRL_WR_DELAY_MASK)

#define BTU2_REG_BTU_RIF_DBUS_RX_PWRCTL_DBUS_RX_PWR_CTRL_WR_ENABLE_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_DBUS_RX_PWRCTL_DBUS_RX_PWR_CTRL_WR_ENABLE_SHIFT (15U)
/*! DBus_Rx_Pwr_Ctrl_Wr_Enable - Enable Automatic Rx Power Control Write on dBus */
#define BTU2_REG_BTU_RIF_DBUS_RX_PWRCTL_DBUS_RX_PWR_CTRL_WR_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_RX_PWRCTL_DBUS_RX_PWR_CTRL_WR_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_RX_PWRCTL_DBUS_RX_PWR_CTRL_WR_ENABLE_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_RXPWRCTL_ADDR - RIF BRF Rx Power Control Address */
/*! @{ */

#define BTU2_REG_BTU_RIF_BRF_RXPWRCTL_ADDR_RX_PWR_CTRL_ADDR_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_BRF_RXPWRCTL_ADDR_RX_PWR_CTRL_ADDR_SHIFT (0U)
/*! Rx_Pwr_Ctrl_Addr - Radio Register Address for Rx Power Control */
#define BTU2_REG_BTU_RIF_BRF_RXPWRCTL_ADDR_RX_PWR_CTRL_ADDR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_RXPWRCTL_ADDR_RX_PWR_CTRL_ADDR_SHIFT)) & BTU2_REG_BTU_RIF_BRF_RXPWRCTL_ADDR_RX_PWR_CTRL_ADDR_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_FSYN_ADDR - RIF BRF FSYN Address */
/*! @{ */

#define BTU2_REG_BTU_RIF_BRF_FSYN_ADDR_FSYN_ADDR_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_BRF_FSYN_ADDR_FSYN_ADDR_SHIFT (0U)
/*! Fsyn_Addr - Radio Register Start Address for Fsyn data */
#define BTU2_REG_BTU_RIF_BRF_FSYN_ADDR_FSYN_ADDR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_FSYN_ADDR_FSYN_ADDR_SHIFT)) & BTU2_REG_BTU_RIF_BRF_FSYN_ADDR_FSYN_ADDR_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_TXPWRCTL_ADDR - RIF BRF Tx Power Control Address */
/*! @{ */

#define BTU2_REG_BTU_RIF_BRF_TXPWRCTL_ADDR_TX_PWR_CTRL_ADDR_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_BRF_TXPWRCTL_ADDR_TX_PWR_CTRL_ADDR_SHIFT (0U)
/*! Tx_Pwr_Ctrl_Addr - Radio Register Address for Tx Power Control */
#define BTU2_REG_BTU_RIF_BRF_TXPWRCTL_ADDR_TX_PWR_CTRL_ADDR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_TXPWRCTL_ADDR_TX_PWR_CTRL_ADDR_SHIFT)) & BTU2_REG_BTU_RIF_BRF_TXPWRCTL_ADDR_TX_PWR_CTRL_ADDR_MASK)
/*! @} */

/*! @name BTU_RIF_BTC_DBUS_RSSI - BTC RIF dBus RSSI */
/*! @{ */

#define BTU2_REG_BTU_RIF_BTC_DBUS_RSSI_DBUS_RSSI_DELAY_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_BTC_DBUS_RSSI_DBUS_RSSI_DELAY_SHIFT (0U)
/*! DBus_RSSI_Delay - Delay from RSSI trigger to start of RSSI read */
#define BTU2_REG_BTU_RIF_BTC_DBUS_RSSI_DBUS_RSSI_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BTC_DBUS_RSSI_DBUS_RSSI_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_BTC_DBUS_RSSI_DBUS_RSSI_DELAY_MASK)

