MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BTU2_REG.h
/*! @name BTU_RIF_SWDBUS_DATA_3_2 - RIF Software dBus Data_3_2 */
/*! @{ */

#define BTU2_REG_BTU_RIF_SWDBUS_DATA_3_2_SW_DBUS_WDATA2_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_3_2_SW_DBUS_WDATA2_SHIFT (0U)
/*! sw_dbus_wdata2 - Software Access Data */
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_3_2_SW_DBUS_WDATA2(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_DATA_3_2_SW_DBUS_WDATA2_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_DATA_3_2_SW_DBUS_WDATA2_MASK)

#define BTU2_REG_BTU_RIF_SWDBUS_DATA_3_2_SW_DBUS_WDATA3_MASK (0xFF00U)
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_3_2_SW_DBUS_WDATA3_SHIFT (8U)
/*! sw_dbus_wdata3 - Software Access Data */
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_3_2_SW_DBUS_WDATA3(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_DATA_3_2_SW_DBUS_WDATA3_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_DATA_3_2_SW_DBUS_WDATA3_MASK)
/*! @} */

/*! @name BTU_RIF_SWDBUS_DATA_5_4 - RIF Software dBus Data_5_4 */
/*! @{ */

#define BTU2_REG_BTU_RIF_SWDBUS_DATA_5_4_SW_DBUS_WDATA4_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_5_4_SW_DBUS_WDATA4_SHIFT (0U)
/*! sw_dbus_wdata4 - Software Access Data */
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_5_4_SW_DBUS_WDATA4(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_DATA_5_4_SW_DBUS_WDATA4_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_DATA_5_4_SW_DBUS_WDATA4_MASK)

#define BTU2_REG_BTU_RIF_SWDBUS_DATA_5_4_SW_DBUS_WDATA5_MASK (0xFF00U)
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_5_4_SW_DBUS_WDATA5_SHIFT (8U)
/*! sw_dbus_wdata5 - Software Access Data */
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_5_4_SW_DBUS_WDATA5(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_DATA_5_4_SW_DBUS_WDATA5_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_DATA_5_4_SW_DBUS_WDATA5_MASK)
/*! @} */

/*! @name BTU_RIF_SWDBUS_DATA_7_6 - RIF Software dBus Data_7_6 */
/*! @{ */

#define BTU2_REG_BTU_RIF_SWDBUS_DATA_7_6_SW_DBUS_WDATA6_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_7_6_SW_DBUS_WDATA6_SHIFT (0U)
/*! sw_dbus_wdata6 - Software Access Data */
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_7_6_SW_DBUS_WDATA6(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_DATA_7_6_SW_DBUS_WDATA6_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_DATA_7_6_SW_DBUS_WDATA6_MASK)

#define BTU2_REG_BTU_RIF_SWDBUS_DATA_7_6_SW_DBUS_WDATA7_MASK (0xFF00U)
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_7_6_SW_DBUS_WDATA7_SHIFT (8U)
/*! sw_dbus_wdata7 - Software Access Data */
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_7_6_SW_DBUS_WDATA7(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_DATA_7_6_SW_DBUS_WDATA7_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_DATA_7_6_SW_DBUS_WDATA7_MASK)
/*! @} */

/*! @name BTU_RIF_TX_FESW - RIF Tx FESW */
/*! @{ */

#define BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_ON_DELAY_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_ON_DELAY_SHIFT (0U)
/*! TX_Fesw_On_Delay - Tx FESW On Delay */
#define BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_ON_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_ON_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_ON_DELAY_MASK)

#define BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_OFF_DELAY_MASK (0x3F00U)
#define BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_OFF_DELAY_SHIFT (8U)
/*! TX_Fesw_Off_Delay - Tx FESW Off Delay */
#define BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_OFF_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_OFF_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_OFF_DELAY_MASK)

#define BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_EN_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_EN_SHIFT (15U)
/*! TX_Fesw_En - Tx Front-End Switch (FESW) Enable
 *  0b0..bttx_fesw is fixed to 0
 *  0b1..enable FESW during for Tx packets
 */
#define BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_EN(x)   (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_EN_SHIFT)) & BTU2_REG_BTU_RIF_TX_FESW_TX_FESW_EN_MASK)
/*! @} */

/*! @name BTU_RIF_RX_FESW - RIF Rx FESW */
/*! @{ */

#define BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_ON_DELAY_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_ON_DELAY_SHIFT (0U)
/*! RX_FESW_On_Delay - Rx FESW On Delay */
#define BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_ON_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_ON_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_ON_DELAY_MASK)

#define BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_OFF_DELAY_MASK (0x3F00U)
#define BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_OFF_DELAY_SHIFT (8U)
/*! RX_FESW_Off_Delay - Rx FESW Off Delay */
#define BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_OFF_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_OFF_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_OFF_DELAY_MASK)

#define BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_EN_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_EN_SHIFT (15U)
/*! RX_FESW_En - Rx FESW Enable
 *  0b0..btrx_fesw is fixed to 0
 *  0b1..enable FESW during for Rx packets
 */
#define BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_EN(x)   (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_EN_SHIFT)) & BTU2_REG_BTU_RIF_RX_FESW_RX_FESW_EN_MASK)
/*! @} */

/*! @name BTU_RIF_RXPAON - RIF Rx PA On */
/*! @{ */

#define BTU2_REG_BTU_RIF_RXPAON_RX_PA_ON_DELAY_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_RXPAON_RX_PA_ON_DELAY_SHIFT (0U)
/*! Rx_PA_On_Delay - Rx PA on Delay */
#define BTU2_REG_BTU_RIF_RXPAON_RX_PA_ON_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RXPAON_RX_PA_ON_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_RXPAON_RX_PA_ON_DELAY_MASK)

#define BTU2_REG_BTU_RIF_RXPAON_RX_PA_ON_EN_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_RXPAON_RX_PA_ON_EN_SHIFT (15U)
/*! Rx_PA_On_En - Rx PA On Delay Enable */
#define BTU2_REG_BTU_RIF_RXPAON_RX_PA_ON_EN(x)   (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RXPAON_RX_PA_ON_EN_SHIFT)) & BTU2_REG_BTU_RIF_RXPAON_RX_PA_ON_EN_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_RX_PU - RIF BRF Power Up for RX */
/*! @{ */

#define BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_ON_DELAY_QUS_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_ON_DELAY_QUS_SHIFT (0U)
/*! brf_rx_pu_on_delay_qus - brf_pu on delay */
#define BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_ON_DELAY_QUS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_ON_DELAY_QUS_SHIFT)) & BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_ON_DELAY_QUS_MASK)

#define BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_OFF_DELAY_QUS_MASK (0x7F00U)
#define BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_OFF_DELAY_QUS_SHIFT (8U)
/*! brf_rx_pu_off_delay_qus - brf_pu off delay */
#define BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_OFF_DELAY_QUS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_OFF_DELAY_QUS_SHIFT)) & BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_OFF_DELAY_QUS_MASK)

#define BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_FIXED_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_FIXED_SHIFT (15U)
/*! brf_rx_pu_fixed - Set brf_pu to a fixed value.
 *  0b0..use programmable timers
 *  0b1..fixed, brf_pu = brf_pu_on_delay_us[0]
 */
#define BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_FIXED(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_FIXED_SHIFT)) & BTU2_REG_BTU_RIF_BRF_RX_PU_BRF_RX_PU_FIXED_MASK)
/*! @} */

