MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BTU2_REG.h
/*! @name BTU_RIF_BTC_DBUS_TX_PKT_END - BTC RIF dBus Tx Packet End Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_BTC_DBUS_TX_PKT_END_DBUS_TX_PKT_END_DELAY_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_BTC_DBUS_TX_PKT_END_DBUS_TX_PKT_END_DELAY_SHIFT (0U)
/*! DBus_Tx_Pkt_End_Delay - dBus Tx Packet End Delay */
#define BTU2_REG_BTU_RIF_BTC_DBUS_TX_PKT_END_DBUS_TX_PKT_END_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BTC_DBUS_TX_PKT_END_DBUS_TX_PKT_END_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_BTC_DBUS_TX_PKT_END_DBUS_TX_PKT_END_DELAY_MASK)

#define BTU2_REG_BTU_RIF_BTC_DBUS_TX_PKT_END_DBUS_TX_PKT_END_ENABLE_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_BTC_DBUS_TX_PKT_END_DBUS_TX_PKT_END_ENABLE_SHIFT (15U)
/*! DBus_Tx_Pkt_End_Enable - Tx Packet End dBus Transaction Enable */
#define BTU2_REG_BTU_RIF_BTC_DBUS_TX_PKT_END_DBUS_TX_PKT_END_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BTC_DBUS_TX_PKT_END_DBUS_TX_PKT_END_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_BTC_DBUS_TX_PKT_END_DBUS_TX_PKT_END_ENABLE_MASK)
/*! @} */

/*! @name BTU_RIF_BTC_DBUS_RX_PKT_END - BTC RIF dBus Rx Packet End Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_BTC_DBUS_RX_PKT_END_DBUS_RX_PKT_END_DELAY_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_BTC_DBUS_RX_PKT_END_DBUS_RX_PKT_END_DELAY_SHIFT (0U)
/*! DBus_Rx_Pkt_End_Delay - dBus Rx Packet End Delay */
#define BTU2_REG_BTU_RIF_BTC_DBUS_RX_PKT_END_DBUS_RX_PKT_END_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BTC_DBUS_RX_PKT_END_DBUS_RX_PKT_END_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_BTC_DBUS_RX_PKT_END_DBUS_RX_PKT_END_DELAY_MASK)

#define BTU2_REG_BTU_RIF_BTC_DBUS_RX_PKT_END_DBUS_RX_PKT_END_ENABLE_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_BTC_DBUS_RX_PKT_END_DBUS_RX_PKT_END_ENABLE_SHIFT (15U)
/*! DBus_Rx_Pkt_End_Enable - Rx Packet End dBus Transaction Enable */
#define BTU2_REG_BTU_RIF_BTC_DBUS_RX_PKT_END_DBUS_RX_PKT_END_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BTC_DBUS_RX_PKT_END_DBUS_RX_PKT_END_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_BTC_DBUS_RX_PKT_END_DBUS_RX_PKT_END_ENABLE_MASK)
/*! @} */

/*! @name BTU_RIF_BTC_DBUS_TX_RAMPDOWN - BTC RIF dBus Tx Rampdown Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_DELAY_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_DELAY_SHIFT (0U)
/*! DBus_Tx_Rampdown_Delay - dBus Tx Rampdown Delay */
#define BTU2_REG_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_DELAY_MASK)

#define BTU2_REG_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_ENABLE_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_ENABLE_SHIFT (15U)
/*! DBus_Tx_Rampdown_Enable - Enables Automatic Rampdown radio after Tx slot on the dBus
 *  0b0..disable automatic ramping down the radio after Tx slot
 *  0b1..enable automatic ramping down the radio after Tx slot
 */
#define BTU2_REG_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_BTC_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_ENABLE_MASK)
/*! @} */

/*! @name BTU_RIF_ERR_PATTERN_TX - RIF Error Pattern Tx */
/*! @{ */

#define BTU2_REG_BTU_RIF_ERR_PATTERN_TX_ERR_PATTERN_TX_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_ERR_PATTERN_TX_ERR_PATTERN_TX_SHIFT (0U)
/*! Err_Pattern_Tx - 16-bit Error Pattern for Tx Packets
 *  0b0000000000000000..no error injection
 *  0b0000000000000001..flip corresponding bit of Tx packets
 */
#define BTU2_REG_BTU_RIF_ERR_PATTERN_TX_ERR_PATTERN_TX(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_PATTERN_TX_ERR_PATTERN_TX_SHIFT)) & BTU2_REG_BTU_RIF_ERR_PATTERN_TX_ERR_PATTERN_TX_MASK)
/*! @} */

/*! @name BTU_RIF_ERR_DELAY1_TX - RIF Error Delay 1 Tx */
/*! @{ */

#define BTU2_REG_BTU_RIF_ERR_DELAY1_TX_ERR_DELAY1_TX_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_ERR_DELAY1_TX_ERR_DELAY1_TX_SHIFT (0U)
/*! Err_Delay1_Tx - Position of Error Insertion in Tx Packet */
#define BTU2_REG_BTU_RIF_ERR_DELAY1_TX_ERR_DELAY1_TX(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_DELAY1_TX_ERR_DELAY1_TX_SHIFT)) & BTU2_REG_BTU_RIF_ERR_DELAY1_TX_ERR_DELAY1_TX_MASK)
/*! @} */

/*! @name BTU_RIF_ERR_DELAY2_TX - RIF Error Delay 2 Tx */
/*! @{ */

#define BTU2_REG_BTU_RIF_ERR_DELAY2_TX_ERR_DELAY2_TX_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_ERR_DELAY2_TX_ERR_DELAY2_TX_SHIFT (0U)
/*! Err_Delay2_Tx - Position of Error Insertion in Tx Packet */
#define BTU2_REG_BTU_RIF_ERR_DELAY2_TX_ERR_DELAY2_TX(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_DELAY2_TX_ERR_DELAY2_TX_SHIFT)) & BTU2_REG_BTU_RIF_ERR_DELAY2_TX_ERR_DELAY2_TX_MASK)
/*! @} */

/*! @name BTU_RIF_ERR_DELAY3_TX - RIF Error Delay 3 Tx */
/*! @{ */

#define BTU2_REG_BTU_RIF_ERR_DELAY3_TX_ERR_DELAY3_TX_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_ERR_DELAY3_TX_ERR_DELAY3_TX_SHIFT (0U)
/*! Err_Delay3_Tx - Position of Error Insertion in Tx Packet */
#define BTU2_REG_BTU_RIF_ERR_DELAY3_TX_ERR_DELAY3_TX(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_DELAY3_TX_ERR_DELAY3_TX_SHIFT)) & BTU2_REG_BTU_RIF_ERR_DELAY3_TX_ERR_DELAY3_TX_MASK)
/*! @} */

/*! @name BTU_RIF_ERR_INJ_TX_CTRL - RIF Error Injection Tx Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_ERR_TX_EN_MASK (0x1U)
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_ERR_TX_EN_SHIFT (0U)
/*! Err_Tx_En - Error Injection Logic for Tx Packets
 *  0b0..disable all error injection logic for Tx packets
 *  0b1..enable error injection logic for Tx packets
 */
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_ERR_TX_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_ERR_TX_EN_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_ERR_TX_EN_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_ERR_TX_MODE_MASK (0x2U)
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_ERR_TX_MODE_SHIFT (1U)
/*! Err_Tx_Mode - Error Injection for Tx Packets
 *  0b0..inject error on nErr_Pkts_Tx number of Tx packets
 *  0b1..inject error on all Tx packets continuously based on Err_Delay'_Tx timer selected in Frame Scheduler
 */
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_ERR_TX_MODE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_ERR_TX_MODE_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_ERR_TX_MODE_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_NERR_PKTS_TX_MASK (0xFCU)
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_NERR_PKTS_TX_SHIFT (2U)
/*! nErr_Pkts_Tx - Number of Tx Error Packets
 *  0b000000..corrupt infinite number of Tx packets
 *  0b000001..n/a
 */
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_NERR_PKTS_TX(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_NERR_PKTS_TX_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_NERR_PKTS_TX_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_DMA_CRC_COR_MASK (0x100U)
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_DMA_CRC_COR_SHIFT (8U)
/*! tx_acl_dma_crc_cor - TX SCO AES Error CRC Corruption Enable */
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_DMA_CRC_COR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_DMA_CRC_COR_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_DMA_CRC_COR_MASK)

