MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BTU2_REG.h
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_DMEM_CRC_COR_MASK (0x400U)
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_DMEM_CRC_COR_SHIFT (10U)
/*! rx_acl_dmem_crc_cor - RX ACL DMEM Error CRC Corruption Enable */
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_DMEM_CRC_COR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_DMEM_CRC_COR_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_DMEM_CRC_COR_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_DMA_CRC_COR_MASK (0x800U)
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_DMA_CRC_COR_SHIFT (11U)
/*! rx_esco_dma_crc_cor - RX eSCO DMA Error CRC Corruption Enable */
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_DMA_CRC_COR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_DMA_CRC_COR_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_DMA_CRC_COR_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_AES_CRC_COR_MASK (0x1000U)
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_AES_CRC_COR_SHIFT (12U)
/*! rx_esco_aes_crc_cor - RX SCO AES Error CRC Corruption Enable */
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_AES_CRC_COR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_AES_CRC_COR_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_AES_CRC_COR_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_DMEM_CRC_COR_MASK (0x2000U)
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_DMEM_CRC_COR_SHIFT (13U)
/*! rx_esco_dmem_crc_cor - RX eSCO DMEM Error CRC Corruption Enable */
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_DMEM_CRC_COR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_DMEM_CRC_COR_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ESCO_DMEM_CRC_COR_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_CRC_COR_EN_MASK (0x4000U)
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_CRC_COR_EN_SHIFT (14U)
/*! rx_crc_cor_en - RX CRC corruption enable */
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_CRC_COR_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_CRC_COR_EN_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_CRC_COR_EN_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_COR_CONFIG_CTRL - RIF Correlator Configuration Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_DBUS_CORCFG_WR_DELAY_MASK (0x7FFU)
#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_DBUS_CORCFG_WR_DELAY_SHIFT (0U)
/*! DBus_CorCfg_Wr_Delay - Rx Mode dBus BRF Correlator Configuration Control Delay */
#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_DBUS_CORCFG_WR_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_DBUS_CORCFG_WR_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_DBUS_CORCFG_WR_DELAY_MASK)

#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_ANT_MASK (0x800U)
#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_ANT_SHIFT (11U)
/*! Cor_Prem_Det_Gate_Syncwd_En_Ant - Enable BRF to start syncword detection after preamble found for Ant Mode */
#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_ANT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_ANT_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_ANT_MASK)

#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_NIKE_MASK (0x1000U)
#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_NIKE_SHIFT (12U)
/*! Cor_Prem_Det_Gate_Syncwd_En_Nike - Enable BRF to start syncword detection after preamble found for Nike Mode */
#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_NIKE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_NIKE_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_NIKE_MASK)

#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_BLE_MASK (0x2000U)
#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_BLE_SHIFT (13U)
/*! Cor_Prem_Det_Gate_Syncwd_En_Ble - Enable BRF to start syncword detection after preamble found for BLE Mode */
#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_BLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_BLE_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_BLE_MASK)

#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_BT_MASK (0x4000U)
#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_BT_SHIFT (14U)
/*! Cor_Prem_Det_Gate_Syncwd_En_Bt - Enable BRF to start syncword detection after preamble found for Bluetooth Mode */
#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_BT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_BT_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_COR_PREM_DET_GATE_SYNCWD_EN_BT_MASK)

#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_DBUS_CORCFG_WR_ENABLE_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_DBUS_CORCFG_WR_ENABLE_SHIFT (15U)
/*! DBus_CorCfg_Wr_Enable - Rx Mode dBus BRF Correlator Configuration Transaction Enable */
#define BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_DBUS_CORCFG_WR_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_DBUS_CORCFG_WR_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_COR_CONFIG_CTRL_DBUS_CORCFG_WR_ENABLE_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_COR_CONFIG_ADDR - RIF BRF Correlator Configuration Address */
/*! @{ */

#define BTU2_REG_BTU_RIF_BRF_COR_CONFIG_ADDR_RX_COR_CFG_ADDR_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_BRF_COR_CONFIG_ADDR_RX_COR_CFG_ADDR_SHIFT (0U)
/*! Rx_Cor_Cfg_Addr - Radio Register Address for Correlator Configuration */
#define BTU2_REG_BTU_RIF_BRF_COR_CONFIG_ADDR_RX_COR_CFG_ADDR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_COR_CONFIG_ADDR_RX_COR_CFG_ADDR_SHIFT)) & BTU2_REG_BTU_RIF_BRF_COR_CONFIG_ADDR_RX_COR_CFG_ADDR_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL - RIF Syncword and Access Code Send Control */
/*! @{ */

