MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BTU2_REG.h
#define BTU2_REG_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_DBUS_SYNCWORD_WR_DELAY_MASK (0x7FFU)
#define BTU2_REG_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_DBUS_SYNCWORD_WR_DELAY_SHIFT (0U)
/*! DBus_Syncword_Wr_Delay - dBus Syncword and Access Code Control Delay */
#define BTU2_REG_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_DBUS_SYNCWORD_WR_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_DBUS_SYNCWORD_WR_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_DBUS_SYNCWORD_WR_DELAY_MASK)

#define BTU2_REG_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_DBUS_SYNCWORD_WR_ENABLE_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_DBUS_SYNCWORD_WR_ENABLE_SHIFT (15U)
/*! DBus_Syncword_Wr_Enable - Rx Mode dBus Syncword and Access Code Transaction Enable */
#define BTU2_REG_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_DBUS_SYNCWORD_WR_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_DBUS_SYNCWORD_WR_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_SYNCWD_ACC_CODE_CTRL_DBUS_SYNCWORD_WR_ENABLE_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_ACC_CODE_ONE_ADDR - RIF BRF Access Code 1 Address */
/*! @{ */

#define BTU2_REG_BTU_RIF_BRF_ACC_CODE_ONE_ADDR_RX_ACC_CODE_ONE_ADDR_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_BRF_ACC_CODE_ONE_ADDR_RX_ACC_CODE_ONE_ADDR_SHIFT (0U)
/*! Rx_Acc_Code_One_Addr - Radio Register Address for First Access Code */
#define BTU2_REG_BTU_RIF_BRF_ACC_CODE_ONE_ADDR_RX_ACC_CODE_ONE_ADDR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_ACC_CODE_ONE_ADDR_RX_ACC_CODE_ONE_ADDR_SHIFT)) & BTU2_REG_BTU_RIF_BRF_ACC_CODE_ONE_ADDR_RX_ACC_CODE_ONE_ADDR_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_ACC_CODE_TWO_ADDR - RIF Access Code 2 Address */
/*! @{ */

#define BTU2_REG_BTU_RIF_BRF_ACC_CODE_TWO_ADDR_RX_ACC_CODE_TWO_ADDR_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_BRF_ACC_CODE_TWO_ADDR_RX_ACC_CODE_TWO_ADDR_SHIFT (0U)
/*! Rx_Acc_Code_Two_Addr - Radio Register Address for Second Access Code */
#define BTU2_REG_BTU_RIF_BRF_ACC_CODE_TWO_ADDR_RX_ACC_CODE_TWO_ADDR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_ACC_CODE_TWO_ADDR_RX_ACC_CODE_TWO_ADDR_SHIFT)) & BTU2_REG_BTU_RIF_BRF_ACC_CODE_TWO_ADDR_RX_ACC_CODE_TWO_ADDR_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_RX_MODE_TYPE_ADDR - RIF Register */
/*! @{ */

#define BTU2_REG_BTU_RIF_BRF_RX_MODE_TYPE_ADDR_RX_MODE_TYPE_ADDR_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_BRF_RX_MODE_TYPE_ADDR_RX_MODE_TYPE_ADDR_SHIFT (0U)
/*! Rx_Mode_Type_Addr - Radio Register Address for Rx Mode Type */
#define BTU2_REG_BTU_RIF_BRF_RX_MODE_TYPE_ADDR_RX_MODE_TYPE_ADDR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_RX_MODE_TYPE_ADDR_RX_MODE_TYPE_ADDR_SHIFT)) & BTU2_REG_BTU_RIF_BRF_RX_MODE_TYPE_ADDR_RX_MODE_TYPE_ADDR_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR - RIF Register */
/*! @{ */

#define BTU2_REG_BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR_RX_PKT_PLD_LEN_ADDR_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR_RX_PKT_PLD_LEN_ADDR_SHIFT (0U)
/*! Rx_Pkt_Pld_Len_Addr - Radio Register Address for Rx Packet Payload Length */
#define BTU2_REG_BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR_RX_PKT_PLD_LEN_ADDR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR_RX_PKT_PLD_LEN_ADDR_SHIFT)) & BTU2_REG_BTU_RIF_BRF_RX_PKT_PLD_LEN_ADDR_RX_PKT_PLD_LEN_ADDR_MASK)
/*! @} */

/*! @name BTU_RIF_RX_SYNC_PULSE_TIMER - RIF BRF Rx Sync Pulse Timer */
/*! @{ */

#define BTU2_REG_BTU_RIF_RX_SYNC_PULSE_TIMER_RX_HDR_PULSE_TIMEOUT_MASK (0x1FU)
#define BTU2_REG_BTU_RIF_RX_SYNC_PULSE_TIMER_RX_HDR_PULSE_TIMEOUT_SHIFT (0U)
/*! Rx_Hdr_Pulse_Timeout - Rx Header Pulse Timeout */
#define BTU2_REG_BTU_RIF_RX_SYNC_PULSE_TIMER_RX_HDR_PULSE_TIMEOUT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_SYNC_PULSE_TIMER_RX_HDR_PULSE_TIMEOUT_SHIFT)) & BTU2_REG_BTU_RIF_RX_SYNC_PULSE_TIMER_RX_HDR_PULSE_TIMEOUT_MASK)

#define BTU2_REG_BTU_RIF_RX_SYNC_PULSE_TIMER_RX_SYNC_PULSE_TIMEOUT_MASK (0x1F00U)
#define BTU2_REG_BTU_RIF_RX_SYNC_PULSE_TIMER_RX_SYNC_PULSE_TIMEOUT_SHIFT (8U)
/*! Rx_Sync_Pulse_Timeout - Rx Sync Pulse Timeout */
#define BTU2_REG_BTU_RIF_RX_SYNC_PULSE_TIMER_RX_SYNC_PULSE_TIMEOUT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_SYNC_PULSE_TIMER_RX_SYNC_PULSE_TIMEOUT_SHIFT)) & BTU2_REG_BTU_RIF_RX_SYNC_PULSE_TIMER_RX_SYNC_PULSE_TIMEOUT_MASK)
/*! @} */

/*! @name BTU_RIF_RX_BTC_SAMP_PHASE_ADJ - RIF Rx Sample Phase Adjustment */
/*! @{ */

#define BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_HDR_START_POS_ADJ_MASK (0x3U)
#define BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_HDR_START_POS_ADJ_SHIFT (0U)
/*! HDR_START_POS_ADJ - Positive Phase Adjustment after Header starts Pulse */
#define BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_HDR_START_POS_ADJ(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_HDR_START_POS_ADJ_SHIFT)) & BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_HDR_START_POS_ADJ_MASK)

#define BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_HDR_START_NEG_ADJ_MASK (0xCU)
#define BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_HDR_START_NEG_ADJ_SHIFT (2U)
/*! HDR_START_NEG_ADJ - Negative Phase Adjustment after Header starts Pulse */
#define BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_HDR_START_NEG_ADJ(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_HDR_START_NEG_ADJ_SHIFT)) & BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_HDR_START_NEG_ADJ_MASK)

#define BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_SYNC_START_POS_ADJ_MASK (0x300U)
#define BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_SYNC_START_POS_ADJ_SHIFT (8U)
/*! SYNC_START_POS_ADJ - Positive Phase Adjustment after Payload Sync starts Pulse */
#define BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_SYNC_START_POS_ADJ(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_SYNC_START_POS_ADJ_SHIFT)) & BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_SYNC_START_POS_ADJ_MASK)

#define BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_SYNC_START_NEG_ADJ_MASK (0xC00U)
#define BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_SYNC_START_NEG_ADJ_SHIFT (10U)
/*! SYNC_START_NEG_ADJ - Negative Phase Adjustment after Header Starts Pulse */
#define BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_SYNC_START_NEG_ADJ(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_SYNC_START_NEG_ADJ_SHIFT)) & BTU2_REG_BTU_RIF_RX_BTC_SAMP_PHASE_ADJ_SYNC_START_NEG_ADJ_MASK)
/*! @} */

