MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BTU2_REG.h
#define BTU2_REG_BTU_RIF_BLE_CTL_BLE_BRF_PU_MASK (0x2U)
#define BTU2_REG_BTU_RIF_BLE_CTL_BLE_BRF_PU_SHIFT (1U)
/*! ble_brf_pu - BLE BRF Power up
 *  0b0..disable
 *  0b1..enable
 */
#define BTU2_REG_BTU_RIF_BLE_CTL_BLE_BRF_PU(x)   (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CTL_BLE_BRF_PU_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CTL_BLE_BRF_PU_MASK)

#define BTU2_REG_BTU_RIF_BLE_CTL_BLE_PLL_REQ_MASK (0x4U)
#define BTU2_REG_BTU_RIF_BLE_CTL_BLE_PLL_REQ_SHIFT (2U)
/*! ble_pll_req - BLE PLL Clock Request
 *  0b0..disable
 *  0b1..enable
 */
#define BTU2_REG_BTU_RIF_BLE_CTL_BLE_PLL_REQ(x)  (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CTL_BLE_PLL_REQ_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CTL_BLE_PLL_REQ_MASK)

#define BTU2_REG_BTU_RIF_BLE_CTL_DATA_LOOPBACK_EN_MASK (0x8U)
#define BTU2_REG_BTU_RIF_BLE_CTL_DATA_LOOPBACK_EN_SHIFT (3U)
/*! data_loopback_en - BLE Loopback Data Enable
 *  0b0..Rx data is from BRF
 *  0b1..Rx data is from Tx block
 */
#define BTU2_REG_BTU_RIF_BLE_CTL_DATA_LOOPBACK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CTL_DATA_LOOPBACK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CTL_DATA_LOOPBACK_EN_MASK)

#define BTU2_REG_BTU_RIF_BLE_CTL_RX_IQ_SAMPLE_PHASE_MASK (0x30U)
#define BTU2_REG_BTU_RIF_BLE_CTL_RX_IQ_SAMPLE_PHASE_SHIFT (4U)
/*! rx_iq_sample_phase - BLE Rx IQ Sampling Rate Phase */
#define BTU2_REG_BTU_RIF_BLE_CTL_RX_IQ_SAMPLE_PHASE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CTL_RX_IQ_SAMPLE_PHASE_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CTL_RX_IQ_SAMPLE_PHASE_MASK)

#define BTU2_REG_BTU_RIF_BLE_CTL_BLE_FREQ_NR_MASK (0x7F00U)
#define BTU2_REG_BTU_RIF_BLE_CTL_BLE_FREQ_NR_SHIFT (8U)
/*! ble_freq_nr - BLE Frequency Channel */
#define BTU2_REG_BTU_RIF_BLE_CTL_BLE_FREQ_NR(x)  (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CTL_BLE_FREQ_NR_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CTL_BLE_FREQ_NR_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_COR_LENGTH_SEL - BLE Correlation Length Selection */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_COR_LENGTH_SEL_BLE_COR_LENGTH_SEL_MASK (0x3U)
#define BTU2_REG_BTU_RIF_BLE_COR_LENGTH_SEL_BLE_COR_LENGTH_SEL_SHIFT (0U)
/*! ble_cor_length_sel - BLE Correlator Length Select
 *  0b00..32 bits
 *  0b01..24 bits
 *  0b10..16 bits
 *  0b11..not valid
 */
#define BTU2_REG_BTU_RIF_BLE_COR_LENGTH_SEL_BLE_COR_LENGTH_SEL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_COR_LENGTH_SEL_BLE_COR_LENGTH_SEL_SHIFT)) & BTU2_REG_BTU_RIF_BLE_COR_LENGTH_SEL_BLE_COR_LENGTH_SEL_MASK)

#define BTU2_REG_BTU_RIF_BLE_COR_LENGTH_SEL_BLE_COR_INDICATOR_MASK (0xCU)
#define BTU2_REG_BTU_RIF_BLE_COR_LENGTH_SEL_BLE_COR_INDICATOR_SHIFT (2U)
/*! ble_cor_indicator - BLE Correlator Indicator
 *  0b00..no correlator enabled
 *  0b01..correlator one enabled
 *  0b10..correlator two enabled
 *  0b11..both correlators enabled
 */
#define BTU2_REG_BTU_RIF_BLE_COR_LENGTH_SEL_BLE_COR_INDICATOR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_COR_LENGTH_SEL_BLE_COR_INDICATOR_SHIFT)) & BTU2_REG_BTU_RIF_BLE_COR_LENGTH_SEL_BLE_COR_INDICATOR_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_COR_ACCESSADDR_0 - BLE AccessCode */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_COR_ACCESSADDR_0_BLE_ACCESS_CODE_0_16_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_BLE_COR_ACCESSADDR_0_BLE_ACCESS_CODE_0_16_SHIFT (0U)
/*! ble_access_code_0_16 - BLE Access Code */
#define BTU2_REG_BTU_RIF_BLE_COR_ACCESSADDR_0_BLE_ACCESS_CODE_0_16(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_COR_ACCESSADDR_0_BLE_ACCESS_CODE_0_16_SHIFT)) & BTU2_REG_BTU_RIF_BLE_COR_ACCESSADDR_0_BLE_ACCESS_CODE_0_16_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_COR_ACCESSADDR_1 - BLE AccessCode */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_COR_ACCESSADDR_1_BLE_ACCESS_CODE_17_32_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_BLE_COR_ACCESSADDR_1_BLE_ACCESS_CODE_17_32_SHIFT (0U)
/*! ble_access_code_17_32 - BLE Access Code */
#define BTU2_REG_BTU_RIF_BLE_COR_ACCESSADDR_1_BLE_ACCESS_CODE_17_32(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_COR_ACCESSADDR_1_BLE_ACCESS_CODE_17_32_SHIFT)) & BTU2_REG_BTU_RIF_BLE_COR_ACCESSADDR_1_BLE_ACCESS_CODE_17_32_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_COR_WINDOW_0 - BLE Correlation Window Size */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_COR_WINDOW_0_BLE_COR_WINDOW_0_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_BLE_COR_WINDOW_0_BLE_COR_WINDOW_0_SHIFT (0U)
/*! ble_cor_window_0 - BLE Correlation Window Size */
#define BTU2_REG_BTU_RIF_BLE_COR_WINDOW_0_BLE_COR_WINDOW_0(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_COR_WINDOW_0_BLE_COR_WINDOW_0_SHIFT)) & BTU2_REG_BTU_RIF_BLE_COR_WINDOW_0_BLE_COR_WINDOW_0_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_COR_WINDOW_1 - BLE Correlation Window Size */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_COR_WINDOW_1_BLE_COR_WINDOW_1_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_BLE_COR_WINDOW_1_BLE_COR_WINDOW_1_SHIFT (0U)
/*! ble_cor_window_1 - BLE Correlation Window Size */
#define BTU2_REG_BTU_RIF_BLE_COR_WINDOW_1_BLE_COR_WINDOW_1(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_COR_WINDOW_1_BLE_COR_WINDOW_1_SHIFT)) & BTU2_REG_BTU_RIF_BLE_COR_WINDOW_1_BLE_COR_WINDOW_1_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_CLK_EN_DELAY - Tx/Rx Clock Enable Signal Delay */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_CLK_EN_DELAY_TX_CLK_EN_DELAY_QUS_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_BLE_CLK_EN_DELAY_TX_CLK_EN_DELAY_QUS_SHIFT (0U)
/*! tx_clk_en_delay_qus - Tx_clk_en Delay Offset */
#define BTU2_REG_BTU_RIF_BLE_CLK_EN_DELAY_TX_CLK_EN_DELAY_QUS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_EN_DELAY_TX_CLK_EN_DELAY_QUS_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_EN_DELAY_TX_CLK_EN_DELAY_QUS_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_EN_DELAY_RX_CLK_EN_DELAY_QUS_MASK (0xFF00U)
#define BTU2_REG_BTU_RIF_BLE_CLK_EN_DELAY_RX_CLK_EN_DELAY_QUS_SHIFT (8U)
/*! rx_clk_en_delay_qus - Rx_clk_en Delay Offset */
#define BTU2_REG_BTU_RIF_BLE_CLK_EN_DELAY_RX_CLK_EN_DELAY_QUS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_EN_DELAY_RX_CLK_EN_DELAY_QUS_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_EN_DELAY_RX_CLK_EN_DELAY_QUS_MASK)
/*! @} */

