MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BTU2_REG.h
/*! @name BTU_RIF_BLE_GO_DELAY - RIF Go Signal Delay */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_GO_DELAY_RIF_TX_GO_DELAY_QUS_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_BLE_GO_DELAY_RIF_TX_GO_DELAY_QUS_SHIFT (0U)
/*! rif_tx_go_delay_qus - RIF_TX_GO Delay Offset */
#define BTU2_REG_BTU_RIF_BLE_GO_DELAY_RIF_TX_GO_DELAY_QUS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_GO_DELAY_RIF_TX_GO_DELAY_QUS_SHIFT)) & BTU2_REG_BTU_RIF_BLE_GO_DELAY_RIF_TX_GO_DELAY_QUS_MASK)

#define BTU2_REG_BTU_RIF_BLE_GO_DELAY_RIF_RX_GO_DELAY_QUS_MASK (0xFF00U)
#define BTU2_REG_BTU_RIF_BLE_GO_DELAY_RIF_RX_GO_DELAY_QUS_SHIFT (8U)
/*! rif_rx_go_delay_qus - RIF_RX_GO Delay Offset */
#define BTU2_REG_BTU_RIF_BLE_GO_DELAY_RIF_RX_GO_DELAY_QUS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_GO_DELAY_RIF_RX_GO_DELAY_QUS_SHIFT)) & BTU2_REG_BTU_RIF_BLE_GO_DELAY_RIF_RX_GO_DELAY_QUS_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA - Tx Power Control DBUS Write Data */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA_RIF_DBUS_TX_PWRCTL_WDATA_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA_RIF_DBUS_TX_PWRCTL_WDATA_SHIFT (0U)
/*! rif_dbus_tx_pwrctl_wdata - Tx Power Control DBUS Write Data */
#define BTU2_REG_BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA_RIF_DBUS_TX_PWRCTL_WDATA(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA_RIF_DBUS_TX_PWRCTL_WDATA_SHIFT)) & BTU2_REG_BTU_RIF_BLE_DBUS_TX_PWRCTL_WDATA_RIF_DBUS_TX_PWRCTL_WDATA_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_TX_FSYN_WDATA - Tx Fsyn DBUS Write Data */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_DBUS_TX_FSYN_WDATA_RIF_DBUS_TX_FSYN_WDATA_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_BLE_DBUS_TX_FSYN_WDATA_RIF_DBUS_TX_FSYN_WDATA_SHIFT (0U)
/*! rif_dbus_tx_fsyn_wdata - Tx Fsyn DBUS Write Data */
#define BTU2_REG_BTU_RIF_BLE_DBUS_TX_FSYN_WDATA_RIF_DBUS_TX_FSYN_WDATA(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_DBUS_TX_FSYN_WDATA_RIF_DBUS_TX_FSYN_WDATA_SHIFT)) & BTU2_REG_BTU_RIF_BLE_DBUS_TX_FSYN_WDATA_RIF_DBUS_TX_FSYN_WDATA_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA - Rx Power Control DBUS Write Data */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA_RIF_DBUS_RX_PWRCTL_WDATA_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA_RIF_DBUS_RX_PWRCTL_WDATA_SHIFT (0U)
/*! rif_dbus_rx_pwrctl_wdata - Rx Power Control DBUS Write Data */
#define BTU2_REG_BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA_RIF_DBUS_RX_PWRCTL_WDATA(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA_RIF_DBUS_RX_PWRCTL_WDATA_SHIFT)) & BTU2_REG_BTU_RIF_BLE_DBUS_RX_PWRCTL_WDATA_RIF_DBUS_RX_PWRCTL_WDATA_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_RX_FSYN_WDATA - Rx Fsyn DBUS Write Data */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_DBUS_RX_FSYN_WDATA_RIF_DBUS_RX_FSYN_WDATA_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_BLE_DBUS_RX_FSYN_WDATA_RIF_DBUS_RX_FSYN_WDATA_SHIFT (0U)
/*! rif_dbus_rx_fsyn_wdata - Rx Fsyn DBUS Write Data */
#define BTU2_REG_BTU_RIF_BLE_DBUS_RX_FSYN_WDATA_RIF_DBUS_RX_FSYN_WDATA(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_DBUS_RX_FSYN_WDATA_RIF_DBUS_RX_FSYN_WDATA_SHIFT)) & BTU2_REG_BTU_RIF_BLE_DBUS_RX_FSYN_WDATA_RIF_DBUS_RX_FSYN_WDATA_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_RX_SYNC_DELAY - BLE Rx Sync Delay */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_RX_SYNC_DELAY_BLE_RX_SYNCPULSE_DELAY_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_BLE_RX_SYNC_DELAY_BLE_RX_SYNCPULSE_DELAY_SHIFT (0U)
#define BTU2_REG_BTU_RIF_BLE_RX_SYNC_DELAY_BLE_RX_SYNCPULSE_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_RX_SYNC_DELAY_BLE_RX_SYNCPULSE_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_BLE_RX_SYNC_DELAY_BLE_RX_SYNCPULSE_DELAY_MASK)

#define BTU2_REG_BTU_RIF_BLE_RX_SYNC_DELAY_BLE_RX_DATAVLD_DELAY_MASK (0xFF00U)
#define BTU2_REG_BTU_RIF_BLE_RX_SYNC_DELAY_BLE_RX_DATAVLD_DELAY_SHIFT (8U)
#define BTU2_REG_BTU_RIF_BLE_RX_SYNC_DELAY_BLE_RX_DATAVLD_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_RX_SYNC_DELAY_BLE_RX_DATAVLD_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_BLE_RX_SYNC_DELAY_BLE_RX_DATAVLD_DELAY_MASK)
/*! @} */

/*! @name BTU_RIF_BRF_RX_CTE_LEN_ADDR - RIF Register */
/*! @{ */

#define BTU2_REG_BTU_RIF_BRF_RX_CTE_LEN_ADDR_RX_CTE_LEN_ADDR_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_BRF_RX_CTE_LEN_ADDR_RX_CTE_LEN_ADDR_SHIFT (0U)
/*! Rx_Cte_Len_Addr - Radio Register Address for Rx CTE Length */
#define BTU2_REG_BTU_RIF_BRF_RX_CTE_LEN_ADDR_RX_CTE_LEN_ADDR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BRF_RX_CTE_LEN_ADDR_RX_CTE_LEN_ADDR_SHIFT)) & BTU2_REG_BTU_RIF_BRF_RX_CTE_LEN_ADDR_RX_CTE_LEN_ADDR_MASK)
/*! @} */

/*! @name BTU_RIF_ARB_BTC_START_TIME - RIF ARB BTC Start Time */
/*! @{ */

#define BTU2_REG_BTU_RIF_ARB_BTC_START_TIME_BTC_TX_START_TIME_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_ARB_BTC_START_TIME_BTC_TX_START_TIME_SHIFT (0U)
#define BTU2_REG_BTU_RIF_ARB_BTC_START_TIME_BTC_TX_START_TIME(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_BTC_START_TIME_BTC_TX_START_TIME_SHIFT)) & BTU2_REG_BTU_RIF_ARB_BTC_START_TIME_BTC_TX_START_TIME_MASK)

#define BTU2_REG_BTU_RIF_ARB_BTC_START_TIME_BTC_RX_START_TIME_MASK (0xFF00U)
#define BTU2_REG_BTU_RIF_ARB_BTC_START_TIME_BTC_RX_START_TIME_SHIFT (8U)
#define BTU2_REG_BTU_RIF_ARB_BTC_START_TIME_BTC_RX_START_TIME(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_BTC_START_TIME_BTC_RX_START_TIME_SHIFT)) & BTU2_REG_BTU_RIF_ARB_BTC_START_TIME_BTC_RX_START_TIME_MASK)
/*! @} */

/*! @name BTU_RIF_ARB_BLE_START_TIME_CODED - RIF ARB BLE Start Time */
/*! @{ */

#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_CODED_BLE_TX_START_TIME_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_CODED_BLE_TX_START_TIME_SHIFT (0U)
#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_CODED_BLE_TX_START_TIME(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_CODED_BLE_TX_START_TIME_SHIFT)) & BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_CODED_BLE_TX_START_TIME_MASK)

#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_CODED_BLE_RX_START_TIME_MASK (0xFF00U)
#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_CODED_BLE_RX_START_TIME_SHIFT (8U)
#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_CODED_BLE_RX_START_TIME(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_CODED_BLE_RX_START_TIME_SHIFT)) & BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_CODED_BLE_RX_START_TIME_MASK)
/*! @} */

/*! @name BTU_RIF_ARB_BLE_START_TIME_1M - RIF ARB BLE Start Time */
/*! @{ */

#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_1M_BLE_TX_START_TIME_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_1M_BLE_TX_START_TIME_SHIFT (0U)
#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_1M_BLE_TX_START_TIME(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_1M_BLE_TX_START_TIME_SHIFT)) & BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_1M_BLE_TX_START_TIME_MASK)

#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_1M_BLE_RX_START_TIME_MASK (0xFF00U)
#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_1M_BLE_RX_START_TIME_SHIFT (8U)
#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_1M_BLE_RX_START_TIME(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_1M_BLE_RX_START_TIME_SHIFT)) & BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_1M_BLE_RX_START_TIME_MASK)
/*! @} */

/*! @name BTU_RIF_ARB_BLE_START_TIME_2M - RIF ARB BLE Start Time */
/*! @{ */

#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_2M_BLE_TX_START_TIME_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_2M_BLE_TX_START_TIME_SHIFT (0U)
#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_2M_BLE_TX_START_TIME(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_2M_BLE_TX_START_TIME_SHIFT)) & BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_2M_BLE_TX_START_TIME_MASK)

#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_2M_BLE_RX_START_TIME_MASK (0xFF00U)
#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_2M_BLE_RX_START_TIME_SHIFT (8U)
#define BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_2M_BLE_RX_START_TIME(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_2M_BLE_RX_START_TIME_SHIFT)) & BTU2_REG_BTU_RIF_ARB_BLE_START_TIME_2M_BLE_RX_START_TIME_MASK)
/*! @} */

/*! @name BTU_RIF_ARB_CTL - RIF ARB Control */
/*! @{ */

