MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BTU2_REG.h
#define BTU2_REG_BTU_RIF_TESTBUS_SEL_1_BTU_TESTBUS_SEL_1_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_TESTBUS_SEL_1_BTU_TESTBUS_SEL_1_SHIFT (0U)
/*! btu_testbus_sel_1 - RIF Testbus Select, Upper Bits
 *  0b0000000000000000..get btc_testbus_out[i]
 *  0b0000000000000001..get ble_testbus_out[i]
 *  0b0000000000000010..get ble_debug_sw_msg_out(URAT)
 *  0b0000000000000011..get ble_test_sw_out[i]
 */
#define BTU2_REG_BTU_RIF_TESTBUS_SEL_1_BTU_TESTBUS_SEL_1(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_TESTBUS_SEL_1_BTU_TESTBUS_SEL_1_SHIFT)) & BTU2_REG_BTU_RIF_TESTBUS_SEL_1_BTU_TESTBUS_SEL_1_MASK)
/*! @} */

/*! @name BTU_RIF_TESTBUS_OE - BTU Testbus Output Enable */
/*! @{ */

#define BTU2_REG_BTU_RIF_TESTBUS_OE_BTU_TESTBUS_OE__MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_TESTBUS_OE_BTU_TESTBUS_OE__SHIFT (0U)
/*! btu_testbus_oe_ - Debug testbus output enable */
#define BTU2_REG_BTU_RIF_TESTBUS_OE_BTU_TESTBUS_OE_(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_TESTBUS_OE_BTU_TESTBUS_OE__SHIFT)) & BTU2_REG_BTU_RIF_TESTBUS_OE_BTU_TESTBUS_OE__MASK)
/*! @} */

/*! @name BTU_RIF_REG_DEBUG_SW_OUTDATA - BLE Debug Output Data */
/*! @{ */

#define BTU2_REG_BTU_RIF_REG_DEBUG_SW_OUTDATA_TESTBUS_SW_OUT_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_REG_DEBUG_SW_OUTDATA_TESTBUS_SW_OUT_SHIFT (0U)
/*! testbus_sw_out - BLE debug software control testbus ouput */
#define BTU2_REG_BTU_RIF_REG_DEBUG_SW_OUTDATA_TESTBUS_SW_OUT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_REG_DEBUG_SW_OUTDATA_TESTBUS_SW_OUT_SHIFT)) & BTU2_REG_BTU_RIF_REG_DEBUG_SW_OUTDATA_TESTBUS_SW_OUT_MASK)
/*! @} */

/*! @name BTU_RIF_REG_DEBUG_INDATA - BLE Debug Input Data */
/*! @{ */

#define BTU2_REG_BTU_RIF_REG_DEBUG_INDATA_TESTBUS_IN_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_REG_DEBUG_INDATA_TESTBUS_IN_SHIFT (0U)
/*! testbus_in - BLE debug testbus input */
#define BTU2_REG_BTU_RIF_REG_DEBUG_INDATA_TESTBUS_IN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_REG_DEBUG_INDATA_TESTBUS_IN_SHIFT)) & BTU2_REG_BTU_RIF_REG_DEBUG_INDATA_TESTBUS_IN_MASK)
/*! @} */

/*! @name BTU_RIF_REG_DEBUG_SW_MSG - BLE Debug Software Message */
/*! @{ */

#define BTU2_REG_BTU_RIF_REG_DEBUG_SW_MSG_DEBUG_SW_MSG_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_REG_DEBUG_SW_MSG_DEBUG_SW_MSG_SHIFT (0U)
/*! DEBUG_SW_MSG - Debug message */
#define BTU2_REG_BTU_RIF_REG_DEBUG_SW_MSG_DEBUG_SW_MSG(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_REG_DEBUG_SW_MSG_DEBUG_SW_MSG_SHIFT)) & BTU2_REG_BTU_RIF_REG_DEBUG_SW_MSG_DEBUG_SW_MSG_MASK)
/*! @} */

/*! @name BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT - BLE Debug Software Message FIFO Count */
/*! @{ */

#define BTU2_REG_BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT_BLE_REG_DEBUG_SW_MSG_FIFO_CNT_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT_BLE_REG_DEBUG_SW_MSG_FIFO_CNT_SHIFT (0U)
/*! BLE_REG_DEBUG_SW_MSG_FIFO_CNT - Debug message FIFO count */
#define BTU2_REG_BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT_BLE_REG_DEBUG_SW_MSG_FIFO_CNT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT_BLE_REG_DEBUG_SW_MSG_FIFO_CNT_SHIFT)) & BTU2_REG_BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT_BLE_REG_DEBUG_SW_MSG_FIFO_CNT_MASK)
/*! @} */

/*! @name BTU_RIF_TESTBUS_CONTROL - RIF Testbus Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_TESTBUS_CONTROL_BTU_RIF_TESTBUS_CONTROL_MASK (0xFU)
#define BTU2_REG_BTU_RIF_TESTBUS_CONTROL_BTU_RIF_TESTBUS_CONTROL_SHIFT (0U)
/*! BTU_RIF_TESTBUS_CONTROL - Testbus bank rotation */
#define BTU2_REG_BTU_RIF_TESTBUS_CONTROL_BTU_RIF_TESTBUS_CONTROL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_TESTBUS_CONTROL_BTU_RIF_TESTBUS_CONTROL_SHIFT)) & BTU2_REG_BTU_RIF_TESTBUS_CONTROL_BTU_RIF_TESTBUS_CONTROL_MASK)
/*! @} */

/*! @name BTU_RIF_BT_CLK_GATING - RIF Bluetooth Clock Gating */
/*! @{ */

#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_EN_MASK (0x1U)
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_EN_SHIFT (0U)
/*! bt_reg_btc_force_clk_en - BTC Force Clock Enable */
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_AES_CLK_EN_MASK (0x2U)
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_AES_CLK_EN_SHIFT (1U)
/*! bt_reg_aes_clk_en - AES Clock Enable */
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_AES_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_AES_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_AES_CLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_RIF_RX_4M_CLK_EN_MASK (0x4U)
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_RIF_RX_4M_CLK_EN_SHIFT (2U)
/*! bt_reg_rif_rx_4m_clk_en - RIF Rx 4M Clock Enable
 *  0b0..rif_rx_4m_clk_en controls clock gating
 *  0b1..forces rif_rx_4m_clk to turn on
 */
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_RIF_RX_4M_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_RIF_RX_4M_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_RIF_RX_4M_CLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_RIF_RX_16M_CLK_EN_MASK (0x8U)
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_RIF_RX_16M_CLK_EN_SHIFT (3U)
/*! bt_reg_rif_rx_16m_clk_en - RIF Rx 16M Clock Enable
 *  0b0..rif_rx_16m_clk_en controls clock gating for rif_rx_16m_clk
 *  0b1..forces rif_rx_16m_clk to turn on
 */
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_RIF_RX_16M_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_RIF_RX_16M_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_RIF_RX_16M_CLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_ONE_MASK (0x10U)
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_ONE_SHIFT (4U)
/*! bt_reg_btc_force_clk_one - BTC Force Clock One */
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_ONE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_ONE_SHIFT)) & BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_ONE_MASK)

