MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BTU2_REG.h
#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BT_REG_FORCE_BLE_CLK_REQ_ZERO_MASK (0x1U)
#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BT_REG_FORCE_BLE_CLK_REQ_ZERO_SHIFT (0U)
/*! bt_reg_force_ble_clk_req_zero - Force BLE Clock Req Zero */
#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BT_REG_FORCE_BLE_CLK_REQ_ZERO(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BT_REG_FORCE_BLE_CLK_REQ_ZERO_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BT_REG_FORCE_BLE_CLK_REQ_ZERO_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BT_REG_FORCE_BLE_CLK_REQ_ONE_MASK (0x2U)
#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BT_REG_FORCE_BLE_CLK_REQ_ONE_SHIFT (1U)
/*! bt_reg_force_ble_clk_req_one - Force BLE Clock Req One */
#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BT_REG_FORCE_BLE_CLK_REQ_ONE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BT_REG_FORCE_BLE_CLK_REQ_ONE_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BT_REG_FORCE_BLE_CLK_REQ_ONE_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_AWAKE_STS_MASK (0x10U)
#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_AWAKE_STS_SHIFT (4U)
/*! ble_awake_sts - BLE Awake Status */
#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_AWAKE_STS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_AWAKE_STS_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_AWAKE_STS_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_CLK_REQ_EARLY_ASSERT_MASK (0x100U)
#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_CLK_REQ_EARLY_ASSERT_SHIFT (8U)
/*! ble_clk_req_early_assert - ble_clk_req early assertion upon any BLE AHB access */
#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_CLK_REQ_EARLY_ASSERT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_CLK_REQ_EARLY_ASSERT_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_CLK_REQ_EARLY_ASSERT_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_SYS_4M_EARLY_UNGATE_MASK (0x200U)
#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_SYS_4M_EARLY_UNGATE_SHIFT (9U)
/*! ble_sys_4m_early_ungate - ble_sys_clk and ble_4m_clk early ungated upon any BLE AHB access */
#define BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_SYS_4M_EARLY_UNGATE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_SYS_4M_EARLY_UNGATE_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_CTRL_BLE_SYS_4M_EARLY_UNGATE_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_TX_PKT_END - BLE RIF dBus Tx Packet End Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_DBUS_TX_PKT_END_DBUS_TX_PKT_END_DELAY_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_BLE_DBUS_TX_PKT_END_DBUS_TX_PKT_END_DELAY_SHIFT (0U)
/*! DBus_Tx_Pkt_End_Delay - dBus Tx Packet End Delay */
#define BTU2_REG_BTU_RIF_BLE_DBUS_TX_PKT_END_DBUS_TX_PKT_END_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_DBUS_TX_PKT_END_DBUS_TX_PKT_END_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_BLE_DBUS_TX_PKT_END_DBUS_TX_PKT_END_DELAY_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_RX_PKT_END - BLE RIF dBus Rx Packet End Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_DBUS_RX_PKT_END_DBUS_RX_PKT_END_DELAY_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_BLE_DBUS_RX_PKT_END_DBUS_RX_PKT_END_DELAY_SHIFT (0U)
/*! DBus_Rx_Pkt_End_Delay - dBus Rx Packet End Delay */
#define BTU2_REG_BTU_RIF_BLE_DBUS_RX_PKT_END_DBUS_RX_PKT_END_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_DBUS_RX_PKT_END_DBUS_RX_PKT_END_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_BLE_DBUS_RX_PKT_END_DBUS_RX_PKT_END_DELAY_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_TX_RAMPDOWN - BLE RIF dBus Tx Rampdown Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_DELAY_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_BLE_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_DELAY_SHIFT (0U)
/*! DBus_Tx_Rampdown_Delay - dBus Tx Rampdown Delay */
#define BTU2_REG_BTU_RIF_BLE_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_BLE_DBUS_TX_RAMPDOWN_DBUS_TX_RAMPDOWN_DELAY_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_DBUS_RSSI - BLE RIF dBus RSSI */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_DBUS_RSSI_DBUS_RSSI_DELAY_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_BLE_DBUS_RSSI_DBUS_RSSI_DELAY_SHIFT (0U)
/*! DBus_RSSI_Delay - Delay from RSSI trigger to start of RSSI read */
#define BTU2_REG_BTU_RIF_BLE_DBUS_RSSI_DBUS_RSSI_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_DBUS_RSSI_DBUS_RSSI_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_BLE_DBUS_RSSI_DBUS_RSSI_DELAY_MASK)
/*! @} */

/*! @name BTU_PTA_SEL_PRI_HIGH - PTA High Priority Select for RIF_ARB Arbitration */
/*! @{ */

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_MSSWITCHPRI_MASK (0x1U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_MSSWITCHPRI_SHIFT (0U)
/*! msSwitchPri - Master / Slave Switch */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_MSSWITCHPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_MSSWITCHPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_MSSWITCHPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_PAGEPRI_MASK (0x2U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_PAGEPRI_SHIFT (1U)
/*! pagePri - Page */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_PAGEPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_PAGEPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_PAGEPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_PSCANPRI_MASK (0x4U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_PSCANPRI_SHIFT (2U)
/*! pScanPri - Page Scan */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_PSCANPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_PSCANPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_PSCANPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_INQPRI_MASK (0x8U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_INQPRI_SHIFT (3U)
/*! inqPri - Inquiry */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_INQPRI(x)  (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_INQPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_INQPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ISCANPRI_MASK (0x10U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ISCANPRI_SHIFT (4U)
/*! iScanPri - Inquiry Scan */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ISCANPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ISCANPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ISCANPRI_MASK)

