MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BTU2_REG.h
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_RETR_EN_MASK (0x200U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_RETR_EN_SHIFT (9U)
/*! sync_esco_retr_en - Sync eSCO Retry Enable */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_RETR_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_RETR_EN_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_RETR_EN_MASK)

#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_ACTIVE_EN_MASK (0x400U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_ACTIVE_EN_SHIFT (10U)
/*! sync_esco_active_en - Sync eSCO Active Enable */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_ACTIVE_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_ACTIVE_EN_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_ACTIVE_EN_MASK)

#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ACTIVE_FW_VAL_MASK (0x1000U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ACTIVE_FW_VAL_SHIFT (12U)
/*! sync_active_fw_val - Sync Frame Active Firmware Value */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ACTIVE_FW_VAL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ACTIVE_FW_VAL_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ACTIVE_FW_VAL_MASK)

#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ACTIVE_FW_EN_MASK (0x2000U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ACTIVE_FW_EN_SHIFT (13U)
/*! sync_active_fw_en - Sync Frame Active Firmware Enable */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ACTIVE_FW_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ACTIVE_FW_EN_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ACTIVE_FW_EN_MASK)

#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_PRIORITY_FW_EN_MASK (0x4000U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_PRIORITY_FW_EN_SHIFT (14U)
/*! sync_priority_fw_en - Sync Frame Priority Firmware Enable */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_PRIORITY_FW_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_PRIORITY_FW_EN_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_PRIORITY_FW_EN_MASK)

#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_DIR_FW_EN_MASK (0x8000U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_DIR_FW_EN_SHIFT (15U)
/*! sync_dir_fw_en - Sync Frame Direction Firmware Enable */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_DIR_FW_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_DIR_FW_EN_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_DIR_FW_EN_MASK)
/*! @} */

/*! @name BTU_PTA_BLE_TX_PWR_THRHD - BLE Tx Power Threshold to Suppress Tx Overlap Assertion */
/*! @{ */

#define BTU2_REG_BTU_PTA_BLE_TX_PWR_THRHD_BLE1M_TX_PWR_THRSHLD_MASK (0xFFU)
#define BTU2_REG_BTU_PTA_BLE_TX_PWR_THRHD_BLE1M_TX_PWR_THRSHLD_SHIFT (0U)
/*! ble1M_tx_pwr_thrshld - BLE Tx power threshold for 1 Mbps packet to suppress BT_Overlap/BT_Scan_Overlap assertion */
#define BTU2_REG_BTU_PTA_BLE_TX_PWR_THRHD_BLE1M_TX_PWR_THRSHLD(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_BLE_TX_PWR_THRHD_BLE1M_TX_PWR_THRSHLD_SHIFT)) & BTU2_REG_BTU_PTA_BLE_TX_PWR_THRHD_BLE1M_TX_PWR_THRSHLD_MASK)

#define BTU2_REG_BTU_PTA_BLE_TX_PWR_THRHD_BLE2M_TX_PWR_THRSHLD_MASK (0xFF00U)
#define BTU2_REG_BTU_PTA_BLE_TX_PWR_THRHD_BLE2M_TX_PWR_THRSHLD_SHIFT (8U)
/*! ble2M_tx_pwr_thrshld - BLE Tx power threshold for 2 Mbps packet to suppress BT_Overlap/BT_Scan_Overlap assertion */
#define BTU2_REG_BTU_PTA_BLE_TX_PWR_THRHD_BLE2M_TX_PWR_THRSHLD(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_BLE_TX_PWR_THRHD_BLE2M_TX_PWR_THRSHLD_SHIFT)) & BTU2_REG_BTU_PTA_BLE_TX_PWR_THRHD_BLE2M_TX_PWR_THRSHLD_MASK)
/*! @} */

/*! @name BTU_PTA_STATE_DELAY_TIMER - PTA Bt_State Delay Timer */
/*! @{ */

#define BTU2_REG_BTU_PTA_STATE_DELAY_TIMER_PTA_STATE_DELAY_MASK (0x3FFU)
#define BTU2_REG_BTU_PTA_STATE_DELAY_TIMER_PTA_STATE_DELAY_SHIFT (0U)
/*! pta_state_delay - PTA State Delay */
#define BTU2_REG_BTU_PTA_STATE_DELAY_TIMER_PTA_STATE_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_STATE_DELAY_TIMER_PTA_STATE_DELAY_SHIFT)) & BTU2_REG_BTU_PTA_STATE_DELAY_TIMER_PTA_STATE_DELAY_MASK)
/*! @} */

/*! @name BTU_PTA_SLNA_CTRL - PTA SLNA Control */
/*! @{ */

#define BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_USE_SLNA_MASK (0x1U)
#define BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_USE_SLNA_SHIFT (0U)
/*! ble_use_slna - BLE uses SLNA based on RSSI info
 *  0b0..use path 3 for Bluetooth only based on BLE RSSI average
 *  0b1..enable SLNA path based on BLE RSSI average
 */
#define BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_USE_SLNA(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_USE_SLNA_SHIFT)) & BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_USE_SLNA_MASK)

#define BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_SLNA_CP_EN_BP_SEL_MASK (0x2U)
#define BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_SLNA_CP_EN_BP_SEL_SHIFT (1U)
/*! ble_slna_cp_en_bp_sel - BLE side enable SLNA bias/charge pump bypass for software control
 *  0b0..use hardware dynamically controlled SLNA_cp_en
 *  0b1..software bypass to control the SLNA_cp_en
 */
#define BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_SLNA_CP_EN_BP_SEL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_SLNA_CP_EN_BP_SEL_SHIFT)) & BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_SLNA_CP_EN_BP_SEL_MASK)

#define BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_SLNA_CP_EN_BP_VAL_MASK (0x4U)
#define BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_SLNA_CP_EN_BP_VAL_SHIFT (2U)
/*! ble_slna_cp_en_bp_val - SLNA_cp Enable
 *  0b0..eisable SLNA cp
 *  0b1..enable SLNA cp
 */
#define BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_SLNA_CP_EN_BP_VAL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_SLNA_CP_EN_BP_VAL_SHIFT)) & BTU2_REG_BTU_PTA_SLNA_CTRL_BLE_SLNA_CP_EN_BP_VAL_MASK)

#define BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_USE_SLNA_MASK (0x100U)
#define BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_USE_SLNA_SHIFT (8U)
/*! btc_use_slna - BTC uses SLNA based on RSSI info
 *  0b0..use path 3 for Bluetooth only based on BTC RSSI average
 *  0b1..enable SLNA path based on BTC RSSI average
 */
#define BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_USE_SLNA(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_USE_SLNA_SHIFT)) & BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_USE_SLNA_MASK)

#define BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_SLNA_CP_EN_BP_SEL_MASK (0x200U)
#define BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_SLNA_CP_EN_BP_SEL_SHIFT (9U)
/*! btc_slna_cp_en_bp_sel - BTC side enable SLNA bias/charge pump bypass for software control
 *  0b0..use hardware dynamically controlled SLNA_cp_en
 *  0b1..software bypass to control the SLNA_cp_en
 */
#define BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_SLNA_CP_EN_BP_SEL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_SLNA_CP_EN_BP_SEL_SHIFT)) & BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_SLNA_CP_EN_BP_SEL_MASK)

#define BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_SLNA_CP_EN_BP_VAL_MASK (0x400U)
#define BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_SLNA_CP_EN_BP_VAL_SHIFT (10U)
/*! btc_slna_cp_en_bp_val - SLNA_cp Enable
 *  0b0..eisable SLNA cp
 *  0b1..enable SLNA cp
 */
#define BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_SLNA_CP_EN_BP_VAL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_SLNA_CP_EN_BP_VAL_SHIFT)) & BTU2_REG_BTU_PTA_SLNA_CTRL_BTC_SLNA_CP_EN_BP_VAL_MASK)
/*! @} */

/*! @name BTU_PTA_TX_POWER_THRESHOLD - Tx Power Threshold to Suppress Tx Overlap Assertion */
/*! @{ */

#define BTU2_REG_BTU_PTA_TX_POWER_THRESHOLD_BDR_TX_PWR_THRSHLD_MASK (0xFFU)
#define BTU2_REG_BTU_PTA_TX_POWER_THRESHOLD_BDR_TX_PWR_THRSHLD_SHIFT (0U)
/*! bdr_tx_pwr_thrshld - Tx power threshold for BDR packet to suppress bt_overlap/bt_scan_overlap assertion */
#define BTU2_REG_BTU_PTA_TX_POWER_THRESHOLD_BDR_TX_PWR_THRSHLD(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_TX_POWER_THRESHOLD_BDR_TX_PWR_THRSHLD_SHIFT)) & BTU2_REG_BTU_PTA_TX_POWER_THRESHOLD_BDR_TX_PWR_THRSHLD_MASK)

#define BTU2_REG_BTU_PTA_TX_POWER_THRESHOLD_EDR_TX_PWR_THRSHLD_MASK (0xFF00U)
#define BTU2_REG_BTU_PTA_TX_POWER_THRESHOLD_EDR_TX_PWR_THRSHLD_SHIFT (8U)
/*! edr_tx_pwr_thrshld - Tx power threshold for EDR packet to suppress bt_overlap/bt_scan_overlap assertion */
#define BTU2_REG_BTU_PTA_TX_POWER_THRESHOLD_EDR_TX_PWR_THRSHLD(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_TX_POWER_THRESHOLD_EDR_TX_PWR_THRSHLD_SHIFT)) & BTU2_REG_BTU_PTA_TX_POWER_THRESHOLD_EDR_TX_PWR_THRSHLD_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_TX_OVERLAP_RANGE - MWS Frequency Overlap Range for Bluetooth Tx Slot */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_TX_OVERLAP_RANGE_TX_MWS_OVERLAP_RANGE_MASK (0xFFU)
#define BTU2_REG_BTU_PTA_MWS_TX_OVERLAP_RANGE_TX_MWS_OVERLAP_RANGE_SHIFT (0U)
/*! tx_mws_overlap_range - MWS frequency overlap range for BR/EDR Tx Slots */
#define BTU2_REG_BTU_PTA_MWS_TX_OVERLAP_RANGE_TX_MWS_OVERLAP_RANGE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_TX_OVERLAP_RANGE_TX_MWS_OVERLAP_RANGE_SHIFT)) & BTU2_REG_BTU_PTA_MWS_TX_OVERLAP_RANGE_TX_MWS_OVERLAP_RANGE_MASK)

