MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BTU2_REG.h
#define BTU2_REG_BTU_PTA_MWS_TX_OVERLAP_RANGE_BLE_TX_MWS_OVERLAP_RANGE_MASK (0xFF00U)
#define BTU2_REG_BTU_PTA_MWS_TX_OVERLAP_RANGE_BLE_TX_MWS_OVERLAP_RANGE_SHIFT (8U)
/*! ble_tx_mws_overlap_range - MWS frequency overlap range for BLE Tx packets */
#define BTU2_REG_BTU_PTA_MWS_TX_OVERLAP_RANGE_BLE_TX_MWS_OVERLAP_RANGE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_TX_OVERLAP_RANGE_BLE_TX_MWS_OVERLAP_RANGE_SHIFT)) & BTU2_REG_BTU_PTA_MWS_TX_OVERLAP_RANGE_BLE_TX_MWS_OVERLAP_RANGE_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_RX_OVERLAP_RANGE - MWS Frequency Overlap Range for Bluetooth Rx Slot */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_RX_OVERLAP_RANGE_RX_MWS_OVERLAP_RANGE_MASK (0xFFU)
#define BTU2_REG_BTU_PTA_MWS_RX_OVERLAP_RANGE_RX_MWS_OVERLAP_RANGE_SHIFT (0U)
/*! rx_mws_overlap_range - MWS frequency overlap range for BR/EDR Rx Slots */
#define BTU2_REG_BTU_PTA_MWS_RX_OVERLAP_RANGE_RX_MWS_OVERLAP_RANGE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_RX_OVERLAP_RANGE_RX_MWS_OVERLAP_RANGE_SHIFT)) & BTU2_REG_BTU_PTA_MWS_RX_OVERLAP_RANGE_RX_MWS_OVERLAP_RANGE_MASK)

#define BTU2_REG_BTU_PTA_MWS_RX_OVERLAP_RANGE_BLE_RX_MWS_OVERLAP_RANGE_MASK (0xFF00U)
#define BTU2_REG_BTU_PTA_MWS_RX_OVERLAP_RANGE_BLE_RX_MWS_OVERLAP_RANGE_SHIFT (8U)
/*! ble_rx_mws_overlap_range - MWS frequency overlap range for BLE Rx Packets */
#define BTU2_REG_BTU_PTA_MWS_RX_OVERLAP_RANGE_BLE_RX_MWS_OVERLAP_RANGE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_RX_OVERLAP_RANGE_BLE_RX_MWS_OVERLAP_RANGE_SHIFT)) & BTU2_REG_BTU_PTA_MWS_RX_OVERLAP_RANGE_BLE_RX_MWS_OVERLAP_RANGE_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_COEX_BT_TX_ON_START - MWS Coex Signal BT_TX_ON Start Timer */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_COEX_BT_TX_ON_START_BTTXONSTARTREG_MASK (0x3FFU)
#define BTU2_REG_BTU_PTA_MWS_COEX_BT_TX_ON_START_BTTXONSTARTREG_SHIFT (0U)
/*! btTxOnStartReg - BT_TX_ON Start Timer */
#define BTU2_REG_BTU_PTA_MWS_COEX_BT_TX_ON_START_BTTXONSTARTREG(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_COEX_BT_TX_ON_START_BTTXONSTARTREG_SHIFT)) & BTU2_REG_BTU_PTA_MWS_COEX_BT_TX_ON_START_BTTXONSTARTREG_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_COEX_BT_TX_ON_END - MWS Coex Signal BT_TX_ON End Timer */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_COEX_BT_TX_ON_END_BTTXONENDREG_MASK (0x3FFU)
#define BTU2_REG_BTU_PTA_MWS_COEX_BT_TX_ON_END_BTTXONENDREG_SHIFT (0U)
/*! btTxOnEndReg - BT_TX_ON End Timer */
#define BTU2_REG_BTU_PTA_MWS_COEX_BT_TX_ON_END_BTTXONENDREG(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_COEX_BT_TX_ON_END_BTTXONENDREG_SHIFT)) & BTU2_REG_BTU_PTA_MWS_COEX_BT_TX_ON_END_BTTXONENDREG_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST - MWS Coex Signal BT_RX_PRI Start Timer for Master Mode */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST_BTRXPRISTARTMSTREG_MASK (0xFFFU)
#define BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST_BTRXPRISTARTMSTREG_SHIFT (0U)
/*! btRxPriStartMstReg - BT_RX_PRI Start Timer for Master Mode */
#define BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST_BTRXPRISTARTMSTREG(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST_BTRXPRISTARTMSTREG_SHIFT)) & BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST_BTRXPRISTARTMSTREG_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_COEX_BT_RX_PRI_END - MWS Coex Signal BT_RX_PRI End Timer */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_END_BTRXPRIENDREG_MASK (0x3FFU)
#define BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_END_BTRXPRIENDREG_SHIFT (0U)
/*! btRxPriEndReg - BT_RX_PRI End Timer */
#define BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_END_BTRXPRIENDREG(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_END_BTRXPRIENDREG_SHIFT)) & BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_END_BTRXPRIENDREG_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_FRAMESYNC_REFCLK_0 - Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFCLK_0_MWSFRAMESYNC_REFCLK_MASK (0xFFFFU)
#define BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFCLK_0_MWSFRAMESYNC_REFCLK_SHIFT (0U)
/*! mwsFrameSync_refClk - Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt */
#define BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFCLK_0_MWSFRAMESYNC_REFCLK(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFCLK_0_MWSFRAMESYNC_REFCLK_SHIFT)) & BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFCLK_0_MWSFRAMESYNC_REFCLK_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_FRAMESYNC_REFCLK_1 - Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFCLK_1_MWSFRAMESYNC_REFCLK_MASK (0x3FFU)
#define BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFCLK_1_MWSFRAMESYNC_REFCLK_SHIFT (0U)
/*! mwsFrameSync_refClk - Bluetooth Reference Clock Snapshot on MWS Frame Sync Pulse Interrupt */
#define BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFCLK_1_MWSFRAMESYNC_REFCLK(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFCLK_1_MWSFRAMESYNC_REFCLK_SHIFT)) & BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFCLK_1_MWSFRAMESYNC_REFCLK_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT - Bluetooth Reference pdBitCounter Snapshot on MWS Frame Sync Pulse Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT_MWSFRAMESYNC_PDBITCNT_MASK (0x1FFFU)
#define BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT_MWSFRAMESYNC_PDBITCNT_SHIFT (0U)
/*! mwsFrameSync_pdBitCnt - Bluetooth Reference pdBitCounter Snapshot on MWS Frame Sync Pulse Interrupt */
#define BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT_MWSFRAMESYNC_PDBITCNT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT_MWSFRAMESYNC_PDBITCNT_SHIFT)) & BTU2_REG_BTU_PTA_MWS_FRAMESYNC_REFPDB_CNT_MWSFRAMESYNC_PDBITCNT_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_PATTERN_REFCLK_0 - Bluetooth Reference Clock Snapshot on MWS_Pattern_Real_Int Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_PATTERN_REFCLK_0_MWSPATTERN_REFCLK_MASK (0xFFFFU)
#define BTU2_REG_BTU_PTA_MWS_PATTERN_REFCLK_0_MWSPATTERN_REFCLK_SHIFT (0U)
/*! mwsPattern_refClk - Bluetooth Reference Clock Snapshot on MWS_PATTERN Pulse Interrupt */
#define BTU2_REG_BTU_PTA_MWS_PATTERN_REFCLK_0_MWSPATTERN_REFCLK(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_PATTERN_REFCLK_0_MWSPATTERN_REFCLK_SHIFT)) & BTU2_REG_BTU_PTA_MWS_PATTERN_REFCLK_0_MWSPATTERN_REFCLK_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_PATTERN_REFCLK_1 - Bluetooth Reference Clock Snapshot on MWS_Pattern_Real_Int Interrupt */
/*! @{ */

