MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BTU2_REG.h
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_17_MASK (0xFU)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_17_SHIFT (0U)
/*! mws_scan_ovlp_range_17 - MWS scan frequency overlap range 17 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_17(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_17_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_17_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_18_MASK (0xF0U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_18_SHIFT (4U)
/*! mws_scan_ovlp_range_18 - MWS scan frequency overlap range 18 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_18(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_18_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_18_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_19_MASK (0xF00U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_19_SHIFT (8U)
/*! mws_scan_ovlp_range_19 - MWS scan frequency overlap range 19 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_19(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_19_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_19_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_20_MASK (0xF000U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_20_SHIFT (12U)
/*! mws_scan_ovlp_range_20 - MWS scan frequency overlap range 20 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_20(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_20_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20_MWS_SCAN_OVLP_RANGE_20_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24 - MWS Scan Frequency Overlap Range 21~24 */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_21_MASK (0xFU)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_21_SHIFT (0U)
/*! mws_scan_ovlp_range_21 - MWS scan frequency overlap range 21 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_21(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_21_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_21_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_22_MASK (0xF0U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_22_SHIFT (4U)
/*! mws_scan_ovlp_range_22 - MWS scan frequency overlap range 22 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_22(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_22_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_22_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_23_MASK (0xF00U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_23_SHIFT (8U)
/*! mws_scan_ovlp_range_23 - MWS scan frequency overlap range 23 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_23(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_23_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_23_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_24_MASK (0xF000U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_24_SHIFT (12U)
/*! mws_scan_ovlp_range_24 - MWS scan frequency overlap range 24 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_24(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_24_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24_MWS_SCAN_OVLP_RANGE_24_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28 - MWS Scan Frequency Overlap Range 25~28 */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_25_MASK (0xFU)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_25_SHIFT (0U)
/*! mws_scan_ovlp_range_25 - MWS scan frequency overlap range 25 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_25(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_25_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_25_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_26_MASK (0xF0U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_26_SHIFT (4U)
/*! mws_scan_ovlp_range_26 - MWS scan frequency overlap range 26 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_26(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_26_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_26_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_27_MASK (0xF00U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_27_SHIFT (8U)
/*! mws_scan_ovlp_range_27 - MWS scan frequency overlap range 27 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_27(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_27_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_27_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_28_MASK (0xF000U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_28_SHIFT (12U)
/*! mws_scan_ovlp_range_28 - MWS scan frequency overlap range 28 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_28(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_28_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28_MWS_SCAN_OVLP_RANGE_28_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31 - MWS Scan Frequency Overlap Range 29~31 */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_29_MASK (0xFU)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_29_SHIFT (0U)
/*! mws_scan_ovlp_range_29 - MWS scan frequency overlap range 29 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_29(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_29_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_29_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_30_MASK (0xF0U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_30_SHIFT (4U)
/*! mws_scan_ovlp_range_30 - MWS scan frequency overlap range 30 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_30(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_30_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_30_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_31_MASK (0xF00U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_31_SHIFT (8U)
/*! mws_scan_ovlp_range_31 - MWS scan frequency overlap range 31 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_31(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_31_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31_MWS_SCAN_OVLP_RANGE_31_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL - MWS Coex Early BT_RX_PRI Control */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_MODE_MASK (0x3U)
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_MODE_SHIFT (0U)
/*! bt_rx_pri_mode - BT_RX_PRI mode selection */
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_MODE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_MODE_SHIFT)) & BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_MODE_MASK)

#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_MST_MASK (0x4U)
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_MST_SHIFT (2U)
/*! bt_rx_pri_page_resp_mst - BT_RX_PRI assertion during page response at master side */
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_MST(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_MST_SHIFT)) & BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_MST_MASK)

